fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
/* Opcode tables for AVR32.
   Copyright 2005,2006,2007,2008,2009 Atmel Corporation.

   Written by Haavard Skinnemoen, Atmel Norway, <hskinnemoen@atmel.com>

   This file is part of libopcodes.

   This program is free software; you can redistribute it and/or
   modify it under the terms of the GNU General Public License as
   published by the Free Software Foundation; either version 2 of the
   License, or (at your option) any later version.

   This program is distributed in the hope that it will be useful, but
   WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
   General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program; if not, write to the Free Software
   Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA
   02111-1307, USA.  */

#include <stdlib.h>
#include <assert.h>

#include "avr32-opc.h"

#define PICO_CPNO	1

void
avr32_insert_simple(const struct avr32_ifield *field,
		    void *buf, unsigned long value)
{
  bfd_vma word;

  word = bfd_getb32(buf);
  word &= ~field->mask;
  word |= (value << field->shift) & field->mask;
  bfd_putb32(word, buf);
}

void
avr32_insert_bit5c(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
		   void *buf, unsigned long value)
{
  char *opcode = buf;

  opcode[0] = (opcode[0] & 0xe1) | (value & 0x1e);
  opcode[1] = (opcode[1] & 0xef) | ((value & 1) << 4);
}

void
avr32_insert_k10(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
		 void *buf, unsigned long value)
{
  char *opcode = buf;

  opcode[0] = (opcode[0] & 0xf0) | ((value & 0xf0) >> 4);
  opcode[1] = ((opcode[1] & 0x0c) | ((value & 0x0f) << 4)
	       | ((value & 0x300) >> 8));
}


void
avr32_insert_k21(const struct avr32_ifield *field,
		 void *buf, unsigned long value)
{
  bfd_vma word;
  bfd_vma k21;

  word = bfd_getb32(buf);
  word &= ~field->mask;
  k21 = ((value & 0xffff) | ((value & 0x10000) << 4)
	 | ((value & 0x1e0000) << 8));
  assert(!(k21 & ~field->mask));
  word |= k21;
  bfd_putb32(word, buf);
}

void
avr32_insert_cpop(const struct avr32_ifield *field,
		  void *buf, unsigned long value)
{
  bfd_vma word;

  word = bfd_getb32(buf);
  word &= ~field->mask;
  word |= (((value & 0x1e) << 15) | ((value & 0x60) << 20)
	   | ((value & 0x01) << 12));
  bfd_putb32(word, buf);
}

void
avr32_insert_k12cp(const struct avr32_ifield *field,
		   void *buf, unsigned long value)
{
  bfd_vma word;

  word = bfd_getb32(buf);
  word &= ~field->mask;
  word |= ((value & 0xf00) << 4) | (value & 0xff);
  bfd_putb32(word, buf);
}

void avr32_extract_simple(const struct avr32_ifield *field,
			  void *buf, unsigned long *value)
{
  /* XXX: The disassembler has done any necessary byteswapping already */
  bfd_vma word = *(bfd_vma *)buf;

  *value = (word & field->mask) >> field->shift;
}

void avr32_extract_bit5c(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
			 void *buf, unsigned long *value)
{
  bfd_vma word = *(bfd_vma *)buf;

  *value = ((word >> 20) & 1) | ((word >> 24) & 0x1e);
}

void avr32_extract_k10(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
		       void *buf, unsigned long *value)
{
  bfd_vma word = *(bfd_vma *)buf;

  *value = ((word >> 8) & 0x300) | ((word >> 20) & 0xff);
}

void avr32_extract_k21(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
		       void *buf, unsigned long *value)
{
  bfd_vma word = *(bfd_vma *)buf;

  *value = ((word & 0xffff) | ((word >> 4) & 0x10000)
	    | ((word >> 8) & 0x1e0000));
}

void avr32_extract_cpop(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
			void *buf, unsigned long *value)
{
  bfd_vma word = *(bfd_vma *)buf;

  *value = (((word >> 12) & 1) | ((word >> 15) & 0x1e)
	    | ((word >> 20) & 0x60));
}

void avr32_extract_k12cp(const struct avr32_ifield *field ATTRIBUTE_UNUSED,
			 void *buf, unsigned long *value)
{
  bfd_vma word = *(bfd_vma *)buf;

  *value = ((word >> 4) & 0xf00) | (word & 0xff);
}


#define IFLD(id, bitsz, shift, mask, func) \
  { AVR32_IFIELD_##id, bitsz, shift, mask, \
    avr32_insert_##func, avr32_extract_##func }

const struct avr32_ifield avr32_ifield_table[] =
  {
    IFLD(RX, 4, 25, 0x1e000000, simple),
    IFLD(RY, 4, 16, 0x000f0000, simple),
    IFLD(COND4C, 4, 20, 0x00f00000, simple),
    IFLD(K8C, 8, 20, 0x0ff00000, simple),
    IFLD(K7C, 7, 20, 0x07f00000, simple),
    IFLD(K5C, 5, 20, 0x01f00000, simple),
    IFLD(K3, 3, 20, 0x00700000, simple),
    IFLD(RY_DW, 3, 17, 0x000e0000, simple),
    IFLD(COND4E, 4, 8, 0x00000f00, simple),
    IFLD(K8E, 8, 0, 0x000000ff, simple),
    IFLD(BIT5C, 5, 20, 0x1e100000, bit5c),
    IFLD(COND3, 3, 16, 0x00070000, simple),
    IFLD(K10, 10, 16, 0x0ff30000, k10),
    IFLD(POPM, 9, 19, 0x0ff80000, simple),
    IFLD(K2, 2, 4, 0x00000030, simple),
    IFLD(RD_E, 4, 0, 0x0000000f, simple),
    IFLD(RD_DW, 3, 1, 0x0000000e, simple),
    IFLD(X, 1, 5, 0x00000020, simple),
    IFLD(Y, 1, 4, 0x00000010, simple),
    IFLD(X2, 1, 13, 0x00002000, simple),
    IFLD(Y2, 1, 12, 0x00001000, simple),
    IFLD(K5E, 5, 0, 0x0000001f, simple),
    IFLD(PART2, 2, 0, 0x00000003, simple),
    IFLD(PART1, 1, 0, 0x00000001, simple),
    IFLD(K16, 16, 0, 0x0000ffff, simple),
    IFLD(CACHEOP, 5, 11, 0x0000f800, simple),
    IFLD(K11, 11, 0, 0x000007ff, simple),
    IFLD(K21, 21, 0, 0x1e10ffff, k21),
    IFLD(CPOP, 7, 12, 0x060f1000, cpop),
    IFLD(CPNO, 3, 13, 0x0000e000, simple),
    IFLD(CRD_RI, 4, 8, 0x00000f00, simple),
    IFLD(CRX, 4, 4, 0x000000f0, simple),
    IFLD(CRY, 4, 0, 0x0000000f, simple),
    IFLD(K7E, 7, 0, 0x0000007f, simple),
    IFLD(CRD_DW, 3, 9, 0x00000e00, simple),
    IFLD(PART1_K12, 1, 12, 0x00001000, simple),
    IFLD(PART2_K12, 2, 12, 0x00003000, simple),
    IFLD(K12, 12, 0, 0x00000fff, simple),
    IFLD(S5, 5, 5, 0x000003e0, simple),
    IFLD(K5E2, 5, 4, 0x000001f0, simple),
    IFLD(K4, 4, 20, 0x00f00000, simple),
    IFLD(COND4E2, 4, 4, 0x000000f0, simple),
    IFLD(K8E2, 8, 4, 0x00000ff0, simple),
    IFLD(K6, 6, 20, 0x03f00000, simple),
    IFLD(MEM15, 15, 0, 0x00007fff, simple),
    IFLD(MEMB5, 5, 15, 0x000f8000, simple),
    IFLD(W, 1, 25, 0x02000000, simple),
    /* Coprocessor Multiple High/Low */
    IFLD(CM_HL, 1, 8, 0x00000100, simple),
    IFLD(K12CP, 12 ,0, 0x0000f0ff, k12cp),
    IFLD(K9E, 9 ,0, 0x000001ff, simple),
    IFLD (FP_RX, 4,  4, 0x000000F0, simple),
    IFLD (FP_RY, 4,  0, 0x0000000F, simple),
    IFLD (FP_RD, 4,  8, 0x00000F00, simple),
    IFLD (FP_RA, 4, 16, 0x000F0000, simple) 
  };
#undef IFLD


