fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
struct avr32_opcode avr32_opc_table[] =
  {
    {
      AVR32_OPC_ABS, 2, 0x5c400000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ABS],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_ACALL, 2, 0xd0000000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_ACALL],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_ACR, 2, 0x5c000000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ACR],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ADC, 4, 0xe0000040, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_ADC],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ADD1, 2, 0x00000000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ADD1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_ADD2, 4, 0xe0000000, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_ADD2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_ADDABS, 4, 0xe0000e40, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_ADDABS],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ADDHH_W, 4, 0xe0000e00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_ADDHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_AND1, 2, 0x00600000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_AND1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_AND2, 4, 0xe1e00000, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_AND2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      },
    },
    {
      AVR32_OPC_AND3, 4, 0xe1e00200, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_AND3],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      },
    },
    {
      AVR32_OPC_ANDH, 4, 0xe4100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ANDH],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_ANDH_COH, 4, 0xe6100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ANDH_COH],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_ANDL, 4, 0xe0100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ANDL],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_ANDL_COH, 4, 0xe2100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ANDL_COH],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_ANDN, 2, 0x00800000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ANDN],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_ASR1, 4, 0xe0000840, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_ASR1],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ASR3, 4, 0xe0001400, 0xe1f0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_ASR3],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_ASR2, 2, 0xa1400000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_ASR2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_BIT5C],
      },
    },
    {
      AVR32_OPC_BLD, 4, 0xedb00000, 0xfff0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_BLD],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_BREQ1, 2, 0xc0000000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BREQ1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRNE1, 2, 0xc0010000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRNE1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRCC1, 2, 0xc0020000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRCC1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRCS1, 2, 0xc0030000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRCS1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRGE1, 2, 0xc0040000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRGE1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRLT1, 2, 0xc0050000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRLT1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRMI1, 2, 0xc0060000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRMI1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BRPL1, 2, 0xc0070000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRPL1],
      BFD_RELOC_AVR32_9H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_BREQ2, 4, 0xe0800000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BREQ2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRNE2, 4, 0xe0810000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRNE2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRCC2, 4, 0xe0820000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRHS2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRCS2, 4, 0xe0830000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRLO2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRGE2, 4, 0xe0840000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRGE2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRLT2, 4, 0xe0850000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRLT2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRMI2, 4, 0xe0860000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRMI2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRPL2, 4, 0xe0870000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRPL2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRLS, 4, 0xe0880000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRLS],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRGT, 4, 0xe0890000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRGT],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRLE, 4, 0xe08a0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRLE],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRHI, 4, 0xe08b0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRHI],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRVS, 4, 0xe08c0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRVS],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRVC, 4, 0xe08d0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRVC],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRQS, 4, 0xe08e0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRQS],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BRAL, 4, 0xe08f0000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_BRAL],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_BREAKPOINT, 2, 0xd6730000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_BREAKPOINT],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_BREV, 2, 0x5c900000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_BREV],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_BST, 4, 0xefb00000, 0xfff0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_BST],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_CACHE, 4, 0xf4100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CACHE],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K11],
	&avr32_ifield_table[AVR32_IFIELD_CACHEOP],
      },
    },
    {
      AVR32_OPC_CASTS_B, 2, 0x5c600000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CASTS_B],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_CASTS_H, 2, 0x5c800000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CASTS_H],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_CASTU_B, 2, 0x5c500000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CASTU_B],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_CASTU_H, 2, 0x5c700000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CASTU_H],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_CBR, 2, 0xa1c00000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_CBR],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_BIT5C],
      },
    },
    {
      AVR32_OPC_CLZ, 4, 0xe0001200, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_CLZ],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_COM, 2, 0x5cd00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_COM],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_COP, 4, 0xe1a00000, 0xf9f00000,
      &avr32_syntax_table[AVR32_SYNTAX_COP],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_CRX],
	&avr32_ifield_table[AVR32_IFIELD_CRY],
	&avr32_ifield_table[AVR32_IFIELD_CPOP],
      },
    },
    {
      AVR32_OPC_CP_B, 4, 0xe0001800, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_CP_B],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_CP_H, 4, 0xe0001900, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_CP_H],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_CP_W1, 2, 0x00300000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_CP_W1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_CP_W2, 2, 0x58000000, 0xfc000000,
      &avr32_syntax_table[AVR32_SYNTAX_CP_W2],
      BFD_RELOC_AVR32_6S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K6],
      },
    },
    {
      AVR32_OPC_CP_W3, 4, 0xe0400000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_CP_W3],
      BFD_RELOC_AVR32_21S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_CPC1, 4, 0xe0001300, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_CPC1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_CPC2, 2, 0x5c200000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_CPC2],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_CSRF, 2, 0xd4030000, 0xfe0f0000,
      &avr32_syntax_table[AVR32_SYNTAX_CSRF],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K5C],
      },
    },
    {
      AVR32_OPC_CSRFCZ, 2, 0xd0030000, 0xfe0f0000,
      &avr32_syntax_table[AVR32_SYNTAX_CSRFCZ],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K5C],
      },
    },
    {
      AVR32_OPC_DIVS, 4, 0xe0000c00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_DIVS],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_DIVU, 4, 0xe0000d00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_DIVU],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_EOR1, 2, 0x00500000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_EOR1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_EOR2, 4, 0xe1e02000, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_EOR2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      }
    },
    {
      AVR32_OPC_EOR3, 4, 0xe1e02200, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_EOR3],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      }
    },
    {
      AVR32_OPC_EORL, 4, 0xec100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_EORL],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_EORH, 4, 0xee100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_EORH],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_FRS, 2, 0xd7430000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_FRS],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_ICALL, 2, 0x5d100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ICALL],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_INCJOSP, 2, 0xd6830000, 0xff8f0000,
      &avr32_syntax_table[AVR32_SYNTAX_INCJOSP],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K3],
      },
    },
    {
      AVR32_OPC_LD_D1, 2, 0xa1010000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_D1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_D2, 2, 0xa1100000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_D2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_D3, 2, 0xa1000000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_D3],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_D5, 4, 0xe0000200, 0xe1f0ffc1,
      &avr32_syntax_table[AVR32_SYNTAX_LD_D5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_D4, 4, 0xe0e00000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_D4],
      BFD_RELOC_AVR32_16S, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LD_SB2, 4, 0xe0000600, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SB2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_SB1, 4, 0xe1200000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SB1],
      BFD_RELOC_AVR32_16S, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LD_UB1, 2, 0x01300000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UB1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_UB2, 2, 0x01700000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UB2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_UB5, 4, 0xe0000700, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UB5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_UB3, 2, 0x01800000, 0xe1800000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UB3],
      BFD_RELOC_AVR32_3U, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K3],
      },
    },
    {
      AVR32_OPC_LD_UB4, 4, 0xe1300000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UB4],
      BFD_RELOC_AVR32_16S, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LD_SH1, 2, 0x01100000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SH1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_SH2, 2, 0x01500000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SH2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_SH5, 4, 0xe0000400, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SH5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_SH3, 2, 0x80000000, 0xe1800000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SH3],
      BFD_RELOC_AVR32_4UH, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K3],
      },
    },
    {
      AVR32_OPC_LD_SH4, 4, 0xe1000000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_SH4],
      BFD_RELOC_AVR32_16S, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LD_UH1, 2, 0x01200000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UH1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_UH2, 2, 0x01600000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UH2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_UH5, 4, 0xe0000500, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UH5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_UH3, 2, 0x80800000, 0xe1800000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UH3],
      BFD_RELOC_AVR32_4UH, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K3],
      },
    },
    {
      AVR32_OPC_LD_UH4, 4, 0xe1100000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_UH4],
      BFD_RELOC_AVR32_16S, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LD_W1, 2, 0x01000000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_W2, 2, 0x01400000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_LD_W5, 4, 0xe0000300, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
