fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
      AVR32_OPC_LD_W6, 4, 0xe0000f80, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W6],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LD_W3, 2, 0x60000000, 0xe0000000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W3],
      BFD_RELOC_AVR32_7UW, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K5C],
      },
    },
    {
      AVR32_OPC_LD_W4, 4, 0xe0f00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_LD_W4],
      BFD_RELOC_AVR32_16S, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LDC_D1, 4, 0xe9a01000, 0xfff01100,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_D1],
      BFD_RELOC_AVR32_10UW, 4, 3,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_LDC_D2, 4, 0xefa00050, 0xfff011ff,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_D2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_LDC_D3, 4, 0xefa01040, 0xfff011c0,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_D3],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LDC_W1, 4, 0xe9a00000, 0xfff01000,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_W1],
      BFD_RELOC_AVR32_10UW, 4, 3,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_LDC_W2, 4, 0xefa00040, 0xfff010ff,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_W2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_LDC_W3, 4, 0xefa01000, 0xfff010c0,
      &avr32_syntax_table[AVR32_SYNTAX_LDC_W3],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_LDC0_D, 4, 0xf3a00000, 0xfff00100,
      &avr32_syntax_table[AVR32_SYNTAX_LDC0_D],
      BFD_RELOC_AVR32_14UW, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K12CP],
      },
    },
    {
      AVR32_OPC_LDC0_W, 4, 0xf1a00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_LDC0_W],
      BFD_RELOC_AVR32_14UW, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K12CP],
      },
    },
    {
      AVR32_OPC_LDCM_D, 4, 0xeda00400, 0xfff01f00,
      &avr32_syntax_table[AVR32_SYNTAX_LDCM_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_LDCM_D_PU, 4, 0xeda01400, 0xfff01f00,
      &avr32_syntax_table[AVR32_SYNTAX_LDCM_D_PU],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_LDCM_W, 4, 0xeda00000, 0xfff01e00,
      &avr32_syntax_table[AVR32_SYNTAX_LDCM_W],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CM_HL],
      },
    },
    {
      AVR32_OPC_LDCM_W_PU, 4, 0xeda01000, 0xfff01e00,
      &avr32_syntax_table[AVR32_SYNTAX_LDCM_W_PU],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CM_HL],
      },
    },
    {
      AVR32_OPC_LDDPC, 2, 0x48000000, 0xf8000000,
      &avr32_syntax_table[AVR32_SYNTAX_LDDPC],
      BFD_RELOC_AVR32_9UW_PCREL, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K7C],
      },
    },
    {
      AVR32_OPC_LDDPC_EXT, 4, 0xfef00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_LDDPC_EXT],
      BFD_RELOC_AVR32_16B_PCREL, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LDDSP, 2, 0x40000000, 0xf8000000,
      &avr32_syntax_table[AVR32_SYNTAX_LDDSP],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K7C],
      },
    },
    {
      AVR32_OPC_LDINS_B, 4, 0xe1d04000, 0xe1f0c000,
      &avr32_syntax_table[AVR32_SYNTAX_LDINS_B],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_PART2_K12],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
      },
    },
    {
      AVR32_OPC_LDINS_H, 4, 0xe1d00000, 0xe1f0e000,
      &avr32_syntax_table[AVR32_SYNTAX_LDINS_H],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_PART1_K12],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
      },
    },
    {
      AVR32_OPC_LDM, 4, 0xe1c00000, 0xfdf00000,
      &avr32_syntax_table[AVR32_SYNTAX_LDM],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_W],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LDMTS, 4, 0xe5c00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_LDMTS],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LDMTS_PU, 4, 0xe7c00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_LDMTS_PU],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_LDSWP_SH, 4, 0xe1d02000, 0xe1f0f000,
      &avr32_syntax_table[AVR32_SYNTAX_LDSWP_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
      },
    },
    {
      AVR32_OPC_LDSWP_UH, 4, 0xe1d03000, 0xe1f0f000,
      &avr32_syntax_table[AVR32_SYNTAX_LDSWP_UH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
      },
    },
    {
      AVR32_OPC_LDSWP_W, 4, 0xe1d08000, 0xe1f0f000,
      &avr32_syntax_table[AVR32_SYNTAX_LDSWP_W],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
      },
    },
    {
      AVR32_OPC_LSL1, 4, 0xe0000940, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_LSL1],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_LSL3, 4, 0xe0001500, 0xe1f0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_LSL3],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_LSL2, 2, 0xa1600000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_LSL2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_BIT5C],
      },
    },
    {
      AVR32_OPC_LSR1, 4, 0xe0000a40, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_LSR1],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_LSR3, 4, 0xe0001600, 0xe1f0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_LSR3],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_LSR2, 2, 0xa1800000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_LSR2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_BIT5C],
      },
    },
    {
      AVR32_OPC_MAC, 4, 0xe0000340, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_MAC],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MACHH_D, 4, 0xe0000580, 0xe1f0ffc1,
      &avr32_syntax_table[AVR32_SYNTAX_MACHH_D],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MACHH_W, 4, 0xe0000480, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MACHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MACS_D, 4, 0xe0000540, 0xe1f0fff1,
      &avr32_syntax_table[AVR32_SYNTAX_MACS_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MACSATHH_W, 4, 0xe0000680, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MACSATHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MACUD, 4, 0xe0000740, 0xe1f0fff1,
      &avr32_syntax_table[AVR32_SYNTAX_MACUD],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MACWH_D, 4, 0xe0000c80, 0xe1f0ffe1,
      &avr32_syntax_table[AVR32_SYNTAX_MACWH_D],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MAX, 4, 0xe0000c40, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_MAX],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MCALL, 4, 0xf0100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MCALL],
      BFD_RELOC_AVR32_18W_PCREL, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_MFDR, 4, 0xe5b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MFDR],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MFSR, 4, 0xe1b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MFSR],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MIN, 4, 0xe0000d40, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_MIN],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MOV3, 2, 0x00900000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_MOV3],
      BFD_RELOC_NONE, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOV1, 2, 0x30000000, 0xf0000000,
      &avr32_syntax_table[AVR32_SYNTAX_MOV1],
      BFD_RELOC_AVR32_8S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_MOV2, 4, 0xe0600000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_MOV2],
      BFD_RELOC_AVR32_21S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_MOVEQ1, 4, 0xe0001700, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVEQ1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVNE1, 4, 0xe0001710, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVNE1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVCC1, 4, 0xe0001720, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVHS1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVCS1, 4, 0xe0001730, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLO1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVGE1, 4, 0xe0001740, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVGE1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVLT1, 4, 0xe0001750, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLT1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVMI1, 4, 0xe0001760, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVMI1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVPL1, 4, 0xe0001770, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVPL1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVLS1, 4, 0xe0001780, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLS1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVGT1, 4, 0xe0001790, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVGT1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVLE1, 4, 0xe00017a0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLE1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVHI1, 4, 0xe00017b0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVHI1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVVS1, 4, 0xe00017c0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVVS1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVVC1, 4, 0xe00017d0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVVC1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVQS1, 4, 0xe00017e0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVQS1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVAL1, 4, 0xe00017f0, 0xe1f0ffff,
      &avr32_syntax_table[AVR32_SYNTAX_MOVAL1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MOVEQ2, 4, 0xf9b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVEQ2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVNE2, 4, 0xf9b00100, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVNE2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVCC2, 4, 0xf9b00200, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVHS2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVCS2, 4, 0xf9b00300, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLO2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVGE2, 4, 0xf9b00400, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVGE2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVLT2, 4, 0xf9b00500, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLT2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVMI2, 4, 0xf9b00600, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVMI2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVPL2, 4, 0xf9b00700, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVPL2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVLS2, 4, 0xf9b00800, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLS2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVGT2, 4, 0xf9b00900, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVGT2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVLE2, 4, 0xf9b00a00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVLE2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVHI2, 4, 0xf9b00b00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVHI2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVVS2, 4, 0xf9b00c00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVVS2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVVC2, 4, 0xf9b00d00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVVC2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVQS2, 4, 0xf9b00e00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVQS2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MOVAL2, 4, 0xf9b00f00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MOVAL2],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MTDR, 4, 0xe7b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MTDR],
      BFD_RELOC_AVR32_8S_EXT, 2, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MTSR, 4, 0xe3b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MTSR],
      BFD_RELOC_AVR32_8S_EXT, 2, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MUL1, 2, 0xa1300000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_MUL1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_MUL2, 4, 0xe0000240, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_MUL2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MUL3, 4, 0xe0001000, 0xe1f0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_MUL3],
      BFD_RELOC_AVR32_8S_EXT, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_MULHH_W, 4, 0xe0000780, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MULHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULNHH_W, 4, 0xe0000180, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MULNHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULNWH_D, 4, 0xe0000280, 0xe1f0ffe1,
      &avr32_syntax_table[AVR32_SYNTAX_MULNWH_D],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULSD, 4, 0xe0000440, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSD],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MULSATHH_H, 4, 0xe0000880, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSATHH_H],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
