fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
      },
    },
    {
      AVR32_OPC_MULSATHH_W, 4, 0xe0000980, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSATHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULSATRNDHH_H, 4, 0xe0000a80, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSATRNDHH_H],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULSATRNDWH_W, 4, 0xe0000b80, 0xe1f0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSATRNDWH_W],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULSATWH_W, 4, 0xe0000e80, 0xe1f0ffe0,
      &avr32_syntax_table[AVR32_SYNTAX_MULSATWH_W],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MULU_D, 4, 0xe0000640, 0xe1f0fff1,
      &avr32_syntax_table[AVR32_SYNTAX_MULU_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MULWH_D, 4, 0xe0000d80, 0xe1f0ffe1,
      &avr32_syntax_table[AVR32_SYNTAX_MULWH_D],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_MUSFR, 2, 0x5d300000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MUSFR],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_MUSTR, 2, 0x5d200000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MUSTR],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_MVCR_D, 4, 0xefa00010, 0xfff111ff,
      &avr32_syntax_table[AVR32_SYNTAX_MVCR_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
      },
    },
    {
      AVR32_OPC_MVCR_W, 4, 0xefa00000, 0xfff010ff,
      &avr32_syntax_table[AVR32_SYNTAX_MVCR_W],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
      },
    },
    {
      AVR32_OPC_MVRC_D, 4, 0xefa00030, 0xfff111ff,
      &avr32_syntax_table[AVR32_SYNTAX_MVRC_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
      },
    },
    {
      AVR32_OPC_MVRC_W, 4, 0xefa00020, 0xfff010ff,
      &avr32_syntax_table[AVR32_SYNTAX_MVRC_W],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_NEG, 2, 0x5c300000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_NEG],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_NOP, 2, 0xd7030000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_NOP],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_OR1, 2, 0x00400000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_OR1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_OR2, 4, 0xe1e01000, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_OR2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      },
    },
    {
      AVR32_OPC_OR3, 4, 0xe1e01200, 0xe1f0fe00,
      &avr32_syntax_table[AVR32_SYNTAX_OR3],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E2],
      },
    },
    {
      AVR32_OPC_ORH, 4, 0xea100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ORH],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_ORL, 4, 0xe8100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ORL],
      BFD_RELOC_AVR32_16U, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_PABS_SB, 4, 0xe00023e0, 0xfff0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PABS_SB],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PABS_SH, 4, 0xe00023f0, 0xfff0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PABS_SH],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PACKSH_SB, 4, 0xe00024d0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PACKSH_SB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PACKSH_UB, 4, 0xe00024c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PACKSH_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PACKW_SH, 4, 0xe0002470, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PACKW_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADD_B, 4, 0xe0002300, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADD_B],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADD_H, 4, 0xe0002000, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADD_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDH_SH, 4, 0xe00020c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDH_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDH_UB, 4, 0xe0002360, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDH_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDS_SB, 4, 0xe0002320, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDS_SB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDS_SH, 4, 0xe0002040, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDS_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDS_UB, 4, 0xe0002340, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDS_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDS_UH, 4, 0xe0002080, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDS_UH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDSUB_H, 4, 0xe0002100, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDSUB_H],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PADDSUBH_SH, 4, 0xe0002280, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDSUBH_SH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PADDSUBS_SH, 4, 0xe0002180, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDSUBS_SH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PADDSUBS_UH, 4, 0xe0002200, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDSUBS_UH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PADDX_H, 4, 0xe0002020, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDX_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDXH_SH, 4, 0xe00020e0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDXH_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDXS_SH, 4, 0xe0002060, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDXS_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PADDXS_UH, 4, 0xe00020a0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PADDXS_UH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PASR_B, 4, 0xe0002410, 0xe1f8fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PASR_B],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_COND3],
      },
    },
    {
      AVR32_OPC_PASR_H, 4, 0xe0002440, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PASR_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PAVG_SH, 4, 0xe00023d0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PAVG_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PAVG_UB, 4, 0xe00023c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PAVG_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PLSL_B, 4, 0xe0002420, 0xe1f8fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PLSL_B],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_COND3],
      },
    },
    {
      AVR32_OPC_PLSL_H, 4, 0xe0002450, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PLSL_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PLSR_B, 4, 0xe0002430, 0xe1f8fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PLSR_B],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_COND3],
      },
    },
    {
      AVR32_OPC_PLSR_H, 4, 0xe0002460, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PLSR_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PMAX_SH, 4, 0xe0002390, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PMAX_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PMAX_UB, 4, 0xe0002380, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PMAX_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PMIN_SH, 4, 0xe00023b0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PMIN_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PMIN_UB, 4, 0xe00023a0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PMIN_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_POPJC, 2, 0xd7130000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_POPJC],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_POPM, 2, 0xd0020000, 0xf0070000,
      &avr32_syntax_table[AVR32_SYNTAX_POPM],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_POPM],
      },
    },
    {
      AVR32_OPC_POPM_E, 4, 0xe3cd0000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_POPM_E],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_PREF, 4, 0xf2100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_PREF],
      BFD_RELOC_AVR32_16S, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_PSAD, 4, 0xe0002400, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSAD],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUB_B, 4, 0xe0002310, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUB_B],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUB_H, 4, 0xe0002010, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUB_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBADD_H, 4, 0xe0002140, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBADD_H],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PSUBADDH_SH, 4, 0xe00022c0, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBADDH_SH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PSUBADDS_SH, 4, 0xe00021c0, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBADDS_SH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PSUBADDS_UH, 4, 0xe0002240, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBADDS_UH],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PSUBH_SH, 4, 0xe00020d0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBH_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBH_UB, 4, 0xe0002370, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBH_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBS_SB, 4, 0xe0002330, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBS_SB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBS_SH, 4, 0xe0002050, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBS_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBS_UB, 4, 0xe0002350, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBS_UB],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBS_UH, 4, 0xe0002090, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBS_UH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBX_H, 4, 0xe0002030, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBX_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBXH_SH, 4, 0xe00020f0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBXH_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBXS_SH, 4, 0xe0002070, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBXS_SH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PSUBXS_UH, 4, 0xe00020b0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_PSUBXS_UH],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_PUNPCKSB_H, 4, 0xe00024a0, 0xe1ffffe0,
      &avr32_syntax_table[AVR32_SYNTAX_PUNPCKSB_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PUNPCKUB_H, 4, 0xe0002480, 0xe1ffffe0,
      &avr32_syntax_table[AVR32_SYNTAX_PUNPCKUB_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_PUSHJC, 2, 0xd7230000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_PUSHJC],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_PUSHM, 2, 0xd0010000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_PUSHM],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_PUSHM_E, 4, 0xebcd0000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_PUSHM_E],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_RCALL1, 2, 0xc00c0000, 0xf00c0000,
      &avr32_syntax_table[AVR32_SYNTAX_RCALL1],
      BFD_RELOC_AVR32_11H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K10],
      },
    },
    {
      AVR32_OPC_RCALL2, 4, 0xe0a00000, 0xe1ef0000,
      &avr32_syntax_table[AVR32_SYNTAX_RCALL2],
      BFD_RELOC_AVR32_22H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_RETEQ, 2, 0x5e000000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETEQ],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETNE, 2, 0x5e100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETNE],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETCC, 2, 0x5e200000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETHS],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETCS, 2, 0x5e300000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETLO],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETGE, 2, 0x5e400000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETGE],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETLT, 2, 0x5e500000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETLT],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETMI, 2, 0x5e600000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETMI],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETPL, 2, 0x5e700000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETPL],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETLS, 2, 0x5e800000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETLS],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
