fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
      AVR32_OPC_RETGT, 2, 0x5e900000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETGT],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETLE, 2, 0x5ea00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETLE],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETHI, 2, 0x5eb00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETHI],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETVS, 2, 0x5ec00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETVS],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETVC, 2, 0x5ed00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETVC],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETQS, 2, 0x5ee00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETQS],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETAL, 2, 0x5ef00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_RETAL],
      BFD_RELOC_NONE, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_RETD, 2, 0xd6230000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_RETD],
      BFD_RELOC_NONE, 0, -1, { NULL },
    },
    {
      AVR32_OPC_RETE, 2, 0xd6030000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_RETE],
      BFD_RELOC_NONE, 0, -1, { NULL },
    },
    {
      AVR32_OPC_RETJ, 2, 0xd6330000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_RETJ],
      BFD_RELOC_NONE, 0, -1, { NULL },
    },
    {
      AVR32_OPC_RETS, 2, 0xd6130000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_RETS],
      BFD_RELOC_NONE, 0, -1, { NULL },
    },
    {
      AVR32_OPC_RJMP, 2, 0xc0080000, 0xf00c0000,
      &avr32_syntax_table[AVR32_SYNTAX_RJMP],
      BFD_RELOC_AVR32_11H_PCREL, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K10],
      },
    },
    {
      AVR32_OPC_ROL, 2, 0x5cf00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ROL],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_ROR, 2, 0x5d000000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_ROR],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_RSUB1, 2, 0x00200000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_RSUB1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_RSUB2, 4, 0xe0001100, 0xe1f0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_RSUB2],
      BFD_RELOC_AVR32_8S_EXT, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SATADD_H, 4, 0xe00002c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_SATADD_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SATADD_W, 4, 0xe00000c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_SATADD_W],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SATRNDS, 4, 0xf3b00000, 0xfff0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_SATRNDS],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
	&avr32_ifield_table[AVR32_IFIELD_S5],
      },
    },
    {
      AVR32_OPC_SATRNDU, 4, 0xf3b00400, 0xfff0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_SATRNDU],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
	&avr32_ifield_table[AVR32_IFIELD_S5],
      },
    },
    {
      AVR32_OPC_SATS, 4, 0xf1b00000, 0xfff0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_SATS],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
	&avr32_ifield_table[AVR32_IFIELD_S5],
      },
    },
    {
      AVR32_OPC_SATSUB_H, 4, 0xe00003c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_SATSUB_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SATSUB_W1, 4, 0xe00001c0, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_SATSUB_W1],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SATSUB_W2, 4, 0xe0d00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_SATSUB_W2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_SATU, 4, 0xf1b00400, 0xfff0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_SATU],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
	&avr32_ifield_table[AVR32_IFIELD_S5],
      },
    },
    {
      AVR32_OPC_SBC, 4, 0xe0000140, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_SBC],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SBR, 2, 0xa1a00000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_SBR],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_BIT5C],
      },
    },
    {
      AVR32_OPC_SCALL, 2, 0xd7330000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_SCALL],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_SCR, 2, 0x5c100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SCR],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SLEEP, 4, 0xe9b00000, 0xffffff00,
      &avr32_syntax_table[AVR32_SYNTAX_SLEEP],
      BFD_RELOC_AVR32_8S_EXT, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SREQ, 2, 0x5f000000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SREQ],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRNE, 2, 0x5f100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRNE],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRCC, 2, 0x5f200000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRHS],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRCS, 2, 0x5f300000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRLO],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRGE, 2, 0x5f400000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRGE],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRLT, 2, 0x5f500000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRLT],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRMI, 2, 0x5f600000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRMI],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRPL, 2, 0x5f700000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRPL],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRLS, 2, 0x5f800000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRLS],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRGT, 2, 0x5f900000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRGT],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRLE, 2, 0x5fa00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRLE],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRHI, 2, 0x5fb00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRHI],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRVS, 2, 0x5fc00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRVS],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRVC, 2, 0x5fd00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRVC],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRQS, 2, 0x5fe00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRQS],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SRAL, 2, 0x5ff00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SRAL],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SSRF, 2, 0xd2030000, 0xfe0f0000,
      &avr32_syntax_table[AVR32_SYNTAX_SSRF],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K5C],
      },
    },
    {
      AVR32_OPC_ST_B1, 2, 0x00c00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_B1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_B2, 2, 0x00f00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_B2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_B5, 4, 0xe0000b00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_ST_B5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
      },
    },
    {
      AVR32_OPC_ST_B3, 2, 0xa0800000, 0xe1800000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_B3],
      BFD_RELOC_AVR32_3U, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K3],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_B4, 4, 0xe1600000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_B4],
      BFD_RELOC_AVR32_16S, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_D1, 2, 0xa1200000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_D1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
      },
    },
    {
      AVR32_OPC_ST_D2, 2, 0xa1210000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_D2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
      },
    },
    {
      AVR32_OPC_ST_D3, 2, 0xa1110000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_D3],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
      },
    },
    {
      AVR32_OPC_ST_D5, 4, 0xe0000800, 0xe1f0ffc1,
      &avr32_syntax_table[AVR32_SYNTAX_ST_D5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_RD_DW],
      },
    },
    {
      AVR32_OPC_ST_D4, 4, 0xe0e10000, 0xe1f10000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_D4],
      BFD_RELOC_AVR32_16S, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
	&avr32_ifield_table[AVR32_IFIELD_RY_DW],
      },
    },
    {
      AVR32_OPC_ST_H1, 2, 0x00b00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_H1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_H2, 2, 0x00e00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_H2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_H5, 4, 0xe0000a00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_ST_H5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
      },
    },
    {
      AVR32_OPC_ST_H3, 2, 0xa0000000, 0xe1800000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_H3],
      BFD_RELOC_AVR32_4UH, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K3],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_H4, 4, 0xe1500000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_H4],
      BFD_RELOC_AVR32_16S, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_W1, 2, 0x00a00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_W1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_W2, 2, 0x00d00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_W2],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_W5, 4, 0xe0000900, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_ST_W5],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
      },
    },
    {
      AVR32_OPC_ST_W3, 2, 0x81000000, 0xe1000000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_W3],
      BFD_RELOC_AVR32_6UW, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K4],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_ST_W4, 4, 0xe1400000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_ST_W4],
      BFD_RELOC_AVR32_16S, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_STC_D1, 4, 0xeba01000, 0xfff01100,
      &avr32_syntax_table[AVR32_SYNTAX_STC_D1],
      BFD_RELOC_AVR32_10UW, 4, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
      },
    },
    {
      AVR32_OPC_STC_D2, 4, 0xefa00070, 0xfff011f0,
      &avr32_syntax_table[AVR32_SYNTAX_STC_D2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
      },
    },
    {
      AVR32_OPC_STC_D3, 4, 0xefa010c0, 0xfff011c0,
      &avr32_syntax_table[AVR32_SYNTAX_STC_D3],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
      },
    },
    {
      AVR32_OPC_STC_W1, 4, 0xeba00000, 0xfff01000,
      &avr32_syntax_table[AVR32_SYNTAX_STC_W1],
      BFD_RELOC_AVR32_10UW, 4, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
      },
    },
    {
      AVR32_OPC_STC_W2, 4, 0xefa00060, 0xfff010ff,
      &avr32_syntax_table[AVR32_SYNTAX_STC_W2],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
      },
    },
    {
      AVR32_OPC_STC_W3, 4, 0xefa01080, 0xfff010c0,
      &avr32_syntax_table[AVR32_SYNTAX_STC_W3],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
      },
    },
    {
      AVR32_OPC_STC0_D, 4, 0xf7a00000, 0xfff00100,
      &avr32_syntax_table[AVR32_SYNTAX_STC0_D],
      BFD_RELOC_AVR32_14UW, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K12CP],
	&avr32_ifield_table[AVR32_IFIELD_CRD_DW],
      },
    },
    {
      AVR32_OPC_STC0_W, 4, 0xf5a00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_STC0_W],
      BFD_RELOC_AVR32_14UW, 3, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K12CP],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
      },
    },
    {
      AVR32_OPC_STCM_D, 4, 0xeda00500, 0xfff01f00,
      &avr32_syntax_table[AVR32_SYNTAX_STCM_D],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_STCM_D_PU, 4, 0xeda01500, 0xfff01f00,
      &avr32_syntax_table[AVR32_SYNTAX_STCM_D_PU],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_STCM_W, 4, 0xeda00200, 0xfff01e00,
      &avr32_syntax_table[AVR32_SYNTAX_STCM_W],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CM_HL],
      },
    },
    {
      AVR32_OPC_STCM_W_PU, 4, 0xeda01200, 0xfff01e00,
      &avr32_syntax_table[AVR32_SYNTAX_STCM_W_PU],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_CPNO],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
	&avr32_ifield_table[AVR32_IFIELD_CM_HL],
      },
    },
    {
      AVR32_OPC_STCOND, 4, 0xe1700000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_STCOND],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_STDSP, 2, 0x50000000, 0xf8000000,
      &avr32_syntax_table[AVR32_SYNTAX_STDSP],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_K7C],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_STHH_W2, 4, 0xe1e08000, 0xe1f0c0c0,
      &avr32_syntax_table[AVR32_SYNTAX_STHH_W2],
      BFD_RELOC_UNUSED, 7, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_CRD_RI],
	&avr32_ifield_table[AVR32_IFIELD_K2],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X2],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y2],
      },
    },
    {
      AVR32_OPC_STHH_W1, 4, 0xe1e0c000, 0xe1f0c000,
      &avr32_syntax_table[AVR32_SYNTAX_STHH_W1],
      BFD_RELOC_AVR32_STHH_W, 6, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_K8E2],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X2],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y2],
      },
    },
    {
      AVR32_OPC_STM, 4, 0xe9c00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_STM],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_STM_PU, 4, 0xebc00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_STM_PU],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_STMTS, 4, 0xedc00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_STMTS],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_STMTS_PU, 4, 0xefc00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_STMTS_PU],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_STSWP_H, 4, 0xe1d09000, 0xe1f0f000,
      &avr32_syntax_table[AVR32_SYNTAX_STSWP_H],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_STSWP_W, 4, 0xe1d0a000, 0xe1f0f000,
      &avr32_syntax_table[AVR32_SYNTAX_STSWP_W],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K12],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_SUB1, 2, 0x00100000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_SUB1],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_SUB2, 4, 0xe0000100, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_SUB2],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K2],
      },
    },
    {
      AVR32_OPC_SUB5, 4, 0xe0c00000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_SUB5],
      BFD_RELOC_AVR32_SUB5, 3, 2,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_SUB3_SP, 2, 0x200d0000, 0xf00f0000,
      &avr32_syntax_table[AVR32_SYNTAX_SUB3_SP],
      BFD_RELOC_AVR32_10SW, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_SUB3, 2, 0x20000000, 0xf0000000,
      &avr32_syntax_table[AVR32_SYNTAX_SUB3],
      BFD_RELOC_AVR32_8S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8C],
      },
    },
    {
      AVR32_OPC_SUB4, 4, 0xe0200000, 0xe1e00000,
      &avr32_syntax_table[AVR32_SYNTAX_SUB4],
      BFD_RELOC_AVR32_21S, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K21],
      },
    },
    {
      AVR32_OPC_SUBEQ, 4, 0xf7b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBEQ],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBNE, 4, 0xf7b00100, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBNE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBCC, 4, 0xf7b00200, 0xfff0ff00,
