fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
      &avr32_syntax_table[AVR32_SYNTAX_SUBHS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBCS, 4, 0xf7b00300, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBLO],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBGE, 4, 0xf7b00400, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBGE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBLT, 4, 0xf7b00500, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBLT],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBMI, 4, 0xf7b00600, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBMI],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBPL, 4, 0xf7b00700, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBPL],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBLS, 4, 0xf7b00800, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBLS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBGT, 4, 0xf7b00900, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBGT],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBLE, 4, 0xf7b00a00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBLE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBHI, 4, 0xf7b00b00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBHI],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBVS, 4, 0xf7b00c00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBVS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBVC, 4, 0xf7b00d00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBVC],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBQS, 4, 0xf7b00e00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBQS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBAL, 4, 0xf7b00f00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBAL],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFEQ, 4, 0xf5b00000, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFEQ],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFNE, 4, 0xf5b00100, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFNE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFCC, 4, 0xf5b00200, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFHS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFCS, 4, 0xf5b00300, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFLO],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFGE, 4, 0xf5b00400, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFGE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFLT, 4, 0xf5b00500, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFLT],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFMI, 4, 0xf5b00600, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFMI],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFPL, 4, 0xf5b00700, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFPL],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFLS, 4, 0xf5b00800, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFLS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFGT, 4, 0xf5b00900, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFGT],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFLE, 4, 0xf5b00a00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFLE],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFHI, 4, 0xf5b00b00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFHI],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFVS, 4, 0xf5b00c00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFVS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFVC, 4, 0xf5b00d00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFVC],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFQS, 4, 0xf5b00e00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFQS],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBFAL, 4, 0xf5b00f00, 0xfff0ff00,
      &avr32_syntax_table[AVR32_SYNTAX_SUBFAL],
      BFD_RELOC_AVR32_8S_EXT, 2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      },
    },
    {
      AVR32_OPC_SUBHH_W, 4, 0xe0000f00, 0xe1f0ffc0,
      &avr32_syntax_table[AVR32_SYNTAX_SUBHH_W],
      BFD_RELOC_UNUSED, 5, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_X],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_Y],
      },
    },
    {
      AVR32_OPC_SWAP_B, 2, 0x5cb00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SWAP_B],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_SWAP_BH, 2, 0x5cc00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SWAP_BH],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_SWAP_H, 2, 0x5ca00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_SWAP_H],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_SYNC, 4, 0xebb00000, 0xffffff00,
      &avr32_syntax_table[AVR32_SYNTAX_SYNC],
      BFD_RELOC_AVR32_8S_EXT, 1, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_K8E],
      }
    },
    {
      AVR32_OPC_TLBR, 2, 0xd6430000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_TLBR],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_TLBS, 2, 0xd6530000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_TLBS],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_TLBW, 2, 0xd6630000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_TLBW],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_TNBZ, 2, 0x5ce00000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_TNBZ],
      BFD_RELOC_UNUSED, 1, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
      }
    },
    {
      AVR32_OPC_TST, 2, 0x00700000, 0xe1f00000,
      &avr32_syntax_table[AVR32_SYNTAX_TST],
      BFD_RELOC_UNUSED, 2, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_RX],
      },
    },
    {
      AVR32_OPC_XCHG, 4, 0xe0000b40, 0xe1f0fff0,
      &avr32_syntax_table[AVR32_SYNTAX_XCHG],
      BFD_RELOC_UNUSED, 3, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RD_E],
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
      },
    },
    {
      AVR32_OPC_MEMC, 4, 0xf6100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MEMC],
      BFD_RELOC_AVR32_15S, 2, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_MEM15],
	&avr32_ifield_table[AVR32_IFIELD_MEMB5],
      },
    },
    {
      AVR32_OPC_MEMS, 4, 0xf8100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MEMS],
      BFD_RELOC_AVR32_15S, 2, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_MEM15],
	&avr32_ifield_table[AVR32_IFIELD_MEMB5],
      },
    },
    {
      AVR32_OPC_MEMT, 4, 0xfa100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MEMT],
      BFD_RELOC_AVR32_15S, 2, 0,
      {
	&avr32_ifield_table[AVR32_IFIELD_MEM15],
	&avr32_ifield_table[AVR32_IFIELD_MEMB5],
      },
    },
    {
      AVR32_OPC_BFEXTS, 4, 0xe1d0b000, 0xe1f0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_BFEXTS],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_S5],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_BFEXTU, 4, 0xe1d0c000, 0xe1f0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_BFEXTU],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_S5],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
    {
      AVR32_OPC_BFINS, 4, 0xe1d0d000, 0xe1f0fc00,
      &avr32_syntax_table[AVR32_SYNTAX_BFINS],
      BFD_RELOC_UNUSED, 4, -1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RX],
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_S5],
	&avr32_ifield_table[AVR32_IFIELD_K5E],
      },
    },
#define AVR32_OPCODE_RSUBCOND(cond_name, cond_field)                    \
    {                                                                   \
      AVR32_OPC_RSUB ## cond_name , 4,                                  \
      0xfbb00000 | (cond_field << 8), 0xfff0ff00,                       \
      &avr32_syntax_table[AVR32_SYNTAX_RSUB ## cond_name ],             \
      BFD_RELOC_AVR32_8S_EXT, 2, 1,                                     \
      {                                                                 \
	&avr32_ifield_table[AVR32_IFIELD_RY],                           \
	&avr32_ifield_table[AVR32_IFIELD_K8E],                          \
      },                                                                \
    },

    AVR32_OPCODE_RSUBCOND (EQ, 0) 
    AVR32_OPCODE_RSUBCOND (NE, 1) 
    AVR32_OPCODE_RSUBCOND (CC, 2) 
    AVR32_OPCODE_RSUBCOND (CS, 3) 
    AVR32_OPCODE_RSUBCOND (GE, 4) 
    AVR32_OPCODE_RSUBCOND (LT, 5) 
    AVR32_OPCODE_RSUBCOND (MI, 6) 
    AVR32_OPCODE_RSUBCOND (PL, 7) 
    AVR32_OPCODE_RSUBCOND (LS, 8) 
    AVR32_OPCODE_RSUBCOND (GT, 9) 
    AVR32_OPCODE_RSUBCOND (LE, 10) 
    AVR32_OPCODE_RSUBCOND (HI, 11) 
    AVR32_OPCODE_RSUBCOND (VS, 12) 
    AVR32_OPCODE_RSUBCOND (VC, 13) 
    AVR32_OPCODE_RSUBCOND (QS, 14) 
    AVR32_OPCODE_RSUBCOND (AL, 15) 

#define AVR32_OPCODE_OP3_COND(op_name, op_field, cond_name, cond_field) \
    {                                                                   \
      AVR32_OPC_ ## op_name ## cond_name , 4,                           \
      0xe1d0e000 | (cond_field << 8) | (op_field << 4), 0xe1f0fff0,     \
      &avr32_syntax_table[AVR32_SYNTAX_ ## op_name ## cond_name ],      \
      BFD_RELOC_UNUSED, 3, -1,                                          \
      {                                                                 \
	&avr32_ifield_table[AVR32_IFIELD_RD_E],                         \
	&avr32_ifield_table[AVR32_IFIELD_RX],                           \
	&avr32_ifield_table[AVR32_IFIELD_RY],                           \
      },                                                                \
    },

    AVR32_OPCODE_OP3_COND (ADD, 0, EQ, 0)
    AVR32_OPCODE_OP3_COND (ADD, 0, NE, 1)
    AVR32_OPCODE_OP3_COND (ADD, 0, CC, 2)
    AVR32_OPCODE_OP3_COND (ADD, 0, CS, 3)
    AVR32_OPCODE_OP3_COND (ADD, 0, GE, 4)
    AVR32_OPCODE_OP3_COND (ADD, 0, LT, 5)
    AVR32_OPCODE_OP3_COND (ADD, 0, MI, 6)
    AVR32_OPCODE_OP3_COND (ADD, 0, PL, 7)
    AVR32_OPCODE_OP3_COND (ADD, 0, LS, 8)
    AVR32_OPCODE_OP3_COND (ADD, 0, GT, 9)
    AVR32_OPCODE_OP3_COND (ADD, 0, LE, 10)
    AVR32_OPCODE_OP3_COND (ADD, 0, HI, 11)
    AVR32_OPCODE_OP3_COND (ADD, 0, VS, 12)
    AVR32_OPCODE_OP3_COND (ADD, 0, VC, 13)
    AVR32_OPCODE_OP3_COND (ADD, 0, QS, 14)
    AVR32_OPCODE_OP3_COND (ADD, 0, AL, 15)

    AVR32_OPCODE_OP3_COND (SUB2, 1, EQ, 0)
    AVR32_OPCODE_OP3_COND (SUB2, 1, NE, 1)
    AVR32_OPCODE_OP3_COND (SUB2, 1, CC, 2)
    AVR32_OPCODE_OP3_COND (SUB2, 1, CS, 3)
    AVR32_OPCODE_OP3_COND (SUB2, 1, GE, 4)
    AVR32_OPCODE_OP3_COND (SUB2, 1, LT, 5)
    AVR32_OPCODE_OP3_COND (SUB2, 1, MI, 6)
    AVR32_OPCODE_OP3_COND (SUB2, 1, PL, 7)
    AVR32_OPCODE_OP3_COND (SUB2, 1, LS, 8)
    AVR32_OPCODE_OP3_COND (SUB2, 1, GT, 9)
    AVR32_OPCODE_OP3_COND (SUB2, 1, LE, 10)
    AVR32_OPCODE_OP3_COND (SUB2, 1, HI, 11)
    AVR32_OPCODE_OP3_COND (SUB2, 1, VS, 12)
    AVR32_OPCODE_OP3_COND (SUB2, 1, VC, 13)
    AVR32_OPCODE_OP3_COND (SUB2, 1, QS, 14)
    AVR32_OPCODE_OP3_COND (SUB2, 1, AL, 15)

    AVR32_OPCODE_OP3_COND (AND, 2, EQ, 0)
    AVR32_OPCODE_OP3_COND (AND, 2, NE, 1)
    AVR32_OPCODE_OP3_COND (AND, 2, CC, 2)
    AVR32_OPCODE_OP3_COND (AND, 2, CS, 3)
    AVR32_OPCODE_OP3_COND (AND, 2, GE, 4)
    AVR32_OPCODE_OP3_COND (AND, 2, LT, 5)
    AVR32_OPCODE_OP3_COND (AND, 2, MI, 6)
    AVR32_OPCODE_OP3_COND (AND, 2, PL, 7)
    AVR32_OPCODE_OP3_COND (AND, 2, LS, 8)
    AVR32_OPCODE_OP3_COND (AND, 2, GT, 9)
    AVR32_OPCODE_OP3_COND (AND, 2, LE, 10)
    AVR32_OPCODE_OP3_COND (AND, 2, HI, 11)
    AVR32_OPCODE_OP3_COND (AND, 2, VS, 12)
    AVR32_OPCODE_OP3_COND (AND, 2, VC, 13)
    AVR32_OPCODE_OP3_COND (AND, 2, QS, 14)
    AVR32_OPCODE_OP3_COND (AND, 2, AL, 15)

    AVR32_OPCODE_OP3_COND (OR, 3, EQ, 0)
    AVR32_OPCODE_OP3_COND (OR, 3, NE, 1)
    AVR32_OPCODE_OP3_COND (OR, 3, CC, 2)
    AVR32_OPCODE_OP3_COND (OR, 3, CS, 3)
    AVR32_OPCODE_OP3_COND (OR, 3, GE, 4)
    AVR32_OPCODE_OP3_COND (OR, 3, LT, 5)
    AVR32_OPCODE_OP3_COND (OR, 3, MI, 6)
    AVR32_OPCODE_OP3_COND (OR, 3, PL, 7)
    AVR32_OPCODE_OP3_COND (OR, 3, LS, 8)
    AVR32_OPCODE_OP3_COND (OR, 3, GT, 9)
    AVR32_OPCODE_OP3_COND (OR, 3, LE, 10)
    AVR32_OPCODE_OP3_COND (OR, 3, HI, 11)
    AVR32_OPCODE_OP3_COND (OR, 3, VS, 12)
    AVR32_OPCODE_OP3_COND (OR, 3, VC, 13)
    AVR32_OPCODE_OP3_COND (OR, 3, QS, 14)
    AVR32_OPCODE_OP3_COND (OR, 3, AL, 15)

    AVR32_OPCODE_OP3_COND (EOR, 4, EQ, 0)
    AVR32_OPCODE_OP3_COND (EOR, 4, NE, 1)
    AVR32_OPCODE_OP3_COND (EOR, 4, CC, 2)
    AVR32_OPCODE_OP3_COND (EOR, 4, CS, 3)
    AVR32_OPCODE_OP3_COND (EOR, 4, GE, 4)
    AVR32_OPCODE_OP3_COND (EOR, 4, LT, 5)
    AVR32_OPCODE_OP3_COND (EOR, 4, MI, 6)
    AVR32_OPCODE_OP3_COND (EOR, 4, PL, 7)
    AVR32_OPCODE_OP3_COND (EOR, 4, LS, 8)
    AVR32_OPCODE_OP3_COND (EOR, 4, GT, 9)
    AVR32_OPCODE_OP3_COND (EOR, 4, LE, 10)
    AVR32_OPCODE_OP3_COND (EOR, 4, HI, 11)
    AVR32_OPCODE_OP3_COND (EOR, 4, VS, 12)
    AVR32_OPCODE_OP3_COND (EOR, 4, VC, 13)
    AVR32_OPCODE_OP3_COND (EOR, 4, QS, 14)
    AVR32_OPCODE_OP3_COND (EOR, 4, AL, 15) 

#define AVR32_OPCODE_LD_COND(op_name, op_field, cond_name, cond_field)  \
    {                                                                   \
      AVR32_OPC_ ## op_name ## cond_name , 4,                           \
      0xe1f00000 | (cond_field << 12) | (op_field  << 9), 0xe1f0fe00,   \
      &avr32_syntax_table[AVR32_SYNTAX_ ## op_name ## cond_name ],      \
      BFD_RELOC_UNUSED, 3, -1,                                          \
      {                                                                 \
	&avr32_ifield_table[AVR32_IFIELD_RY],                           \
	&avr32_ifield_table[AVR32_IFIELD_RX],                           \
	&avr32_ifield_table[AVR32_IFIELD_K9E],                          \
      },                                                                \
    },
    
