fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
#define AVR32_OPCODE_ST_COND(op_name, op_field, cond_name, cond_field)  \
    {                                                                   \
      AVR32_OPC_ ## op_name ## cond_name , 4,                           \
      0xe1f00000 | (cond_field << 12) | (op_field  << 9), 0xe1f0fe00,   \
      &avr32_syntax_table[AVR32_SYNTAX_ ## op_name ## cond_name ],      \
      BFD_RELOC_UNUSED, 3, -1,                                          \
      {                                                                 \
	&avr32_ifield_table[AVR32_IFIELD_RX],                           \
	&avr32_ifield_table[AVR32_IFIELD_K9E],                          \
	&avr32_ifield_table[AVR32_IFIELD_RY],                           \
      },                                                                \
    },

    AVR32_OPCODE_LD_COND (LD_W, 0, EQ, 0) 
    AVR32_OPCODE_LD_COND (LD_W, 0, NE, 1) 
    AVR32_OPCODE_LD_COND (LD_W, 0, CC, 2) 
    AVR32_OPCODE_LD_COND (LD_W, 0, CS, 3) 
    AVR32_OPCODE_LD_COND (LD_W, 0, GE, 4) 
    AVR32_OPCODE_LD_COND (LD_W, 0, LT, 5) 
    AVR32_OPCODE_LD_COND (LD_W, 0, MI, 6) 
    AVR32_OPCODE_LD_COND (LD_W, 0, PL, 7) 
    AVR32_OPCODE_LD_COND (LD_W, 0, LS, 8) 
    AVR32_OPCODE_LD_COND (LD_W, 0, GT, 9) 
    AVR32_OPCODE_LD_COND (LD_W, 0, LE, 10) 
    AVR32_OPCODE_LD_COND (LD_W, 0, HI, 11) 
    AVR32_OPCODE_LD_COND (LD_W, 0, VS, 12) 
    AVR32_OPCODE_LD_COND (LD_W, 0, VC, 13) 
    AVR32_OPCODE_LD_COND (LD_W, 0, QS, 14) 
    AVR32_OPCODE_LD_COND (LD_W, 0, AL, 15) 

    AVR32_OPCODE_LD_COND (LD_SH, 1, EQ, 0) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, NE, 1) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, CC, 2) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, CS, 3) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, GE, 4) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, LT, 5) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, MI, 6) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, PL, 7) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, LS, 8) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, GT, 9) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, LE, 10) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, HI, 11) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, VS, 12) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, VC, 13) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, QS, 14) 
    AVR32_OPCODE_LD_COND (LD_SH, 1, AL, 15) 

    AVR32_OPCODE_LD_COND (LD_UH, 2, EQ, 0) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, NE, 1) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, CC, 2) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, CS, 3) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, GE, 4) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, LT, 5) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, MI, 6) 
    AVR32_OPCODE_LD_COND (LD_UH, 2, PL, 7) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, LS, 8) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, GT, 9) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, LE, 10) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, HI, 11) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, VS, 12) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, VC, 13) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, QS, 14) 
    AVR32_OPCODE_LD_COND (LD_SH, 2, AL, 15) 

    AVR32_OPCODE_LD_COND (LD_SB, 3, EQ, 0) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, NE, 1) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, CC, 2) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, CS, 3) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, GE, 4) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, LT, 5) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, MI, 6) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, PL, 7) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, LS, 8) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, GT, 9) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, LE, 10) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, HI, 11) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, VS, 12) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, VC, 13) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, QS, 14) 
    AVR32_OPCODE_LD_COND (LD_SB, 3, AL, 15) 

    AVR32_OPCODE_LD_COND (LD_UB, 4, EQ, 0) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, NE, 1) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, CC, 2) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, CS, 3) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, GE, 4) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, LT, 5) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, MI, 6) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, PL, 7) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, LS, 8) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, GT, 9) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, LE, 10) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, HI, 11) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, VS, 12) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, VC, 13) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, QS, 14) 
    AVR32_OPCODE_LD_COND (LD_UB, 4, AL, 15) 

    AVR32_OPCODE_ST_COND (ST_W, 5, EQ, 0) 
    AVR32_OPCODE_ST_COND (ST_W, 5, NE, 1) 
    AVR32_OPCODE_ST_COND (ST_W, 5, CC, 2) 
    AVR32_OPCODE_ST_COND (ST_W, 5, CS, 3) 
    AVR32_OPCODE_ST_COND (ST_W, 5, GE, 4) 
    AVR32_OPCODE_ST_COND (ST_W, 5, LT, 5) 
    AVR32_OPCODE_ST_COND (ST_W, 5, MI, 6) 
    AVR32_OPCODE_ST_COND (ST_W, 5, PL, 7) 
    AVR32_OPCODE_ST_COND (ST_W, 5, LS, 8) 
    AVR32_OPCODE_ST_COND (ST_W, 5, GT, 9) 
    AVR32_OPCODE_ST_COND (ST_W, 5, LE, 10) 
    AVR32_OPCODE_ST_COND (ST_W, 5, HI, 11) 
    AVR32_OPCODE_ST_COND (ST_W, 5, VS, 12) 
    AVR32_OPCODE_ST_COND (ST_W, 5, VC, 13) 
    AVR32_OPCODE_ST_COND (ST_W, 5, QS, 14) 
    AVR32_OPCODE_ST_COND (ST_W, 5, AL, 15) 

    AVR32_OPCODE_ST_COND (ST_H, 6, EQ, 0) 
    AVR32_OPCODE_ST_COND (ST_H, 6, NE, 1) 
    AVR32_OPCODE_ST_COND (ST_H, 6, CC, 2) 
    AVR32_OPCODE_ST_COND (ST_H, 6, CS, 3) 
    AVR32_OPCODE_ST_COND (ST_H, 6, GE, 4) 
    AVR32_OPCODE_ST_COND (ST_H, 6, LT, 5) 
    AVR32_OPCODE_ST_COND (ST_H, 6, MI, 6) 
    AVR32_OPCODE_ST_COND (ST_H, 6, PL, 7) 
    AVR32_OPCODE_ST_COND (ST_H, 6, LS, 8) 
    AVR32_OPCODE_ST_COND (ST_H, 6, GT, 9) 
    AVR32_OPCODE_ST_COND (ST_H, 6, LE, 10) 
    AVR32_OPCODE_ST_COND (ST_H, 6, HI, 11) 
    AVR32_OPCODE_ST_COND (ST_H, 6, VS, 12) 
    AVR32_OPCODE_ST_COND (ST_H, 6, VC, 13) 
    AVR32_OPCODE_ST_COND (ST_H, 6, QS, 14) 
    AVR32_OPCODE_ST_COND (ST_H, 6, AL, 15) 

    AVR32_OPCODE_ST_COND (ST_B, 7, EQ, 0) 
    AVR32_OPCODE_ST_COND (ST_B, 7, NE, 1) 
    AVR32_OPCODE_ST_COND (ST_B, 7, CC, 2) 
    AVR32_OPCODE_ST_COND (ST_B, 7, CS, 3) 
    AVR32_OPCODE_ST_COND (ST_B, 7, GE, 4) 
    AVR32_OPCODE_ST_COND (ST_B, 7, LT, 5) 
    AVR32_OPCODE_ST_COND (ST_B, 7, MI, 6) 
    AVR32_OPCODE_ST_COND (ST_B, 7, PL, 7) 
    AVR32_OPCODE_ST_COND (ST_B, 7, LS, 8) 
    AVR32_OPCODE_ST_COND (ST_B, 7, GT, 9) 
    AVR32_OPCODE_ST_COND (ST_B, 7, LE, 10) 
    AVR32_OPCODE_ST_COND (ST_B, 7, HI, 11) 
    AVR32_OPCODE_ST_COND (ST_B, 7, VS, 12) 
    AVR32_OPCODE_ST_COND (ST_B, 7, VC, 13) 
    AVR32_OPCODE_ST_COND (ST_B, 7, QS, 14) 
    AVR32_OPCODE_ST_COND (ST_B, 7, AL, 15) 

    {
      AVR32_OPC_MOVH, 4, 0xfc100000, 0xfff00000,
      &avr32_syntax_table[AVR32_SYNTAX_MOVH],
      BFD_RELOC_AVR32_16U,  2, 1,
      {
	&avr32_ifield_table[AVR32_IFIELD_RY],
	&avr32_ifield_table[AVR32_IFIELD_K16],
      },
    },
    {
      AVR32_OPC_SSCALL, 2, 0xd7530000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_SSCALL],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },
    {
      AVR32_OPC_RETSS, 2, 0xd7630000, 0xffff0000,
      &avr32_syntax_table[AVR32_SYNTAX_RETSS],
      BFD_RELOC_UNUSED, 0, -1, { NULL },
    },

  {
    AVR32_OPC_FMAC_S, 4, 0xE1A00000, 0xFFF0F000,
    &avr32_syntax_table[AVR32_SYNTAX_FMAC_S],
    BFD_RELOC_UNUSED, 4, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RA],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FNMAC_S, 4, 0xE1A01000, 0xFFF0F000,
    &avr32_syntax_table[AVR32_SYNTAX_FNMAC_S],
    BFD_RELOC_UNUSED, 4, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RA],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FMSC_S, 4, 0xE3A00000, 0xFFF0F000,
    &avr32_syntax_table[AVR32_SYNTAX_FMSC_S],
    BFD_RELOC_UNUSED, 4, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RA],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FNMSC_S, 4, 0xE3A01000, 0xFFF0F000,
    &avr32_syntax_table[AVR32_SYNTAX_FNMSC_S],
    BFD_RELOC_UNUSED, 4, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RA],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FMUL_S, 4, 0xE5A20000, 0xFFFFF000,
    &avr32_syntax_table[AVR32_SYNTAX_FMUL_S],
    BFD_RELOC_UNUSED, 3, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FNMUL_S, 4, 0xE5A30000, 0xFFFFF000,
    &avr32_syntax_table[AVR32_SYNTAX_FNMUL_S],
    BFD_RELOC_UNUSED, 3, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FADD_S, 4, 0xE5A00000, 0xFFFFF000,
    &avr32_syntax_table[AVR32_SYNTAX_FADD_S],
    BFD_RELOC_UNUSED, 3, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FSUB_S, 4, 0xE5A10000, 0xFFFFF000,
    &avr32_syntax_table[AVR32_SYNTAX_FSUB_S],
    BFD_RELOC_UNUSED, 3, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCASTRS_SW, 4, 0xE5AB0000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FCASTRS_SW],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCASTRS_UW, 4, 0xE5A90000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FCASTRS_UW],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCASTSW_S, 4, 0xE5A60000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FCASTSW_S],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCASTUW_S, 4, 0xE5A40000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FCASTUW_S],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCMP_S, 4, 0xE5AC0000, 0xFFFFFF00,
    &avr32_syntax_table[AVR32_SYNTAX_FCMP_S],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RX],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FCHK_S, 4, 0xE5AD0000, 0xFFFFFFF0,
    &avr32_syntax_table[AVR32_SYNTAX_FCHK_S],
    BFD_RELOC_UNUSED, 1, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FRCPA_S, 4, 0xE5AE0000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FRCPA_S],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  },
  {
    AVR32_OPC_FRSQRTA_S, 4, 0xE5AF0000, 0xFFFFF0F0,
    &avr32_syntax_table[AVR32_SYNTAX_FRSQRTA_S],
    BFD_RELOC_UNUSED, 2, -1,
    {
      &avr32_ifield_table[AVR32_IFIELD_FP_RD],
      &avr32_ifield_table[AVR32_IFIELD_FP_RY]
    }
  }

