fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
};


const struct avr32_alias avr32_alias_table[] =
  {
    {
      AVR32_ALIAS_PICOSVMAC0,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0c },
      },
    },
    {
      AVR32_ALIAS_PICOSVMAC1,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0d },
      },
    },
    {
      AVR32_ALIAS_PICOSVMAC2,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0e },
      },
    },
    {
      AVR32_ALIAS_PICOSVMAC3,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0f },
      },
    },
    {
      AVR32_ALIAS_PICOSVMUL0,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x08 },
      },
    },
    {
      AVR32_ALIAS_PICOSVMUL1,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x09 },
      },
    },
    {
      AVR32_ALIAS_PICOSVMUL2,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0a },
      },
    },
    {
      AVR32_ALIAS_PICOSVMUL3,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x0b },
      },
    },
    {
      AVR32_ALIAS_PICOVMAC0,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x04 },
      },
    },
    {
      AVR32_ALIAS_PICOVMAC1,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x05 },
      },
    },
    {
      AVR32_ALIAS_PICOVMAC2,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x06 },
      },
    },
    {
      AVR32_ALIAS_PICOVMAC3,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x07 },
      },
    },
    {
      AVR32_ALIAS_PICOVMUL0,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x00 },
      },
    },
    {
      AVR32_ALIAS_PICOVMUL1,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x01 },
      },
    },
    {
      AVR32_ALIAS_PICOVMUL2,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x02 },
      },
    },
    {
      AVR32_ALIAS_PICOVMUL3,
      &avr32_opc_table[AVR32_OPC_COP],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
	{ 0, 0x03 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_D1,
      &avr32_opc_table[AVR32_OPC_LDC_D1],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_D2,
      &avr32_opc_table[AVR32_OPC_LDC_D2],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_D3,
      &avr32_opc_table[AVR32_OPC_LDC_D3],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 }, { 1, 3 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_W1,
      &avr32_opc_table[AVR32_OPC_LDC_W1],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_W2,
      &avr32_opc_table[AVR32_OPC_LDC_W2],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLD_W3,
      &avr32_opc_table[AVR32_OPC_LDC_W3],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 }, { 1, 3 },
      },
    },
    {
      AVR32_ALIAS_PICOLDM_D,
      &avr32_opc_table[AVR32_OPC_LDCM_D],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLDM_D_PU,
      &avr32_opc_table[AVR32_OPC_LDCM_D_PU],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOLDM_W,
      &avr32_opc_table[AVR32_OPC_LDCM_W],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
    {
      AVR32_ALIAS_PICOLDM_W_PU,
      &avr32_opc_table[AVR32_OPC_LDCM_W_PU],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
    {
      AVR32_ALIAS_PICOMV_D1,
      &avr32_opc_table[AVR32_OPC_MVCR_D],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOMV_D2,
      &avr32_opc_table[AVR32_OPC_MVRC_D],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOMV_W1,
      &avr32_opc_table[AVR32_OPC_MVCR_W],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOMV_W2,
      &avr32_opc_table[AVR32_OPC_MVRC_W],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOST_D1,
      &avr32_opc_table[AVR32_OPC_STC_D1],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
    {
      AVR32_ALIAS_PICOST_D2,
      &avr32_opc_table[AVR32_OPC_STC_D2],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOST_D3,
      &avr32_opc_table[AVR32_OPC_STC_D3],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 }, { 1, 3 },
      },
    },
    {
      AVR32_ALIAS_PICOST_W1,
      &avr32_opc_table[AVR32_OPC_STC_W1],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
    {
      AVR32_ALIAS_PICOST_W2,
      &avr32_opc_table[AVR32_OPC_STC_W2],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOST_W3,
      &avr32_opc_table[AVR32_OPC_STC_W3],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 }, { 1, 3 },
      },
    },
    {
      AVR32_ALIAS_PICOSTM_D,
      &avr32_opc_table[AVR32_OPC_STCM_D],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOSTM_D_PU,
      &avr32_opc_table[AVR32_OPC_STCM_D_PU],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 },
      },
    },
    {
      AVR32_ALIAS_PICOSTM_W,
      &avr32_opc_table[AVR32_OPC_STCM_W],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
    {
      AVR32_ALIAS_PICOSTM_W_PU,
      &avr32_opc_table[AVR32_OPC_STCM_W_PU],
      {
	{ 0, PICO_CPNO },
	{ 1, 0 }, { 1, 1 }, { 1, 2 },
      },
    },
  };


