fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
    SYNTAX_NORMAL2(ST_BMI, ST_BMI, ST_BMI, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BPL, ST_BPL, ST_BPL, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BLS, ST_BLS, ST_BLS, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BGT, ST_BGT, ST_BGT, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BLE, ST_BLE, ST_BLE, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BHI, ST_BHI, ST_BHI, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BVS, ST_BVS, ST_BVS, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BVC, ST_BVC, ST_BVC, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BQS, ST_BQS, ST_BQS, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BAL, ST_BAL, ST_BAL, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BHS, ST_BHS, ST_BCC, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(ST_BLO, ST_BLO, ST_BCS, INTREG_UDISP, INTREG, AVR32_V2),
    SYNTAX_NORMAL2(MOVH, MOVH, MOVH, INTREG, UNSIGNED_CONST, AVR32_V2),

  };

#define NORMAL_MNEMONIC(name, syntax, str)		\
  {							\
    AVR32_MNEMONIC_##name, str,				\
    &avr32_syntax_table[AVR32_SYNTAX_##syntax],		\
  }
#define FP_MNEMONIC(name, syntax, str)			\
  NORMAL_MNEMONIC(name##_S, syntax##_S, str ".s"),	\
  NORMAL_MNEMONIC(name##_D, syntax##_D, str ".d")

const struct avr32_mnemonic avr32_mnemonic_table[] =
  {
    NORMAL_MNEMONIC(ABS, ABS, "abs"),
    NORMAL_MNEMONIC(ACALL, ACALL, "acall"),
    NORMAL_MNEMONIC(ACR, ACR, "acr"),
    NORMAL_MNEMONIC(ADC, ADC, "adc"),
    NORMAL_MNEMONIC(ADD, ADD1, "add"),
    NORMAL_MNEMONIC(ADDABS, ADDABS, "addabs"),
    NORMAL_MNEMONIC(ADDHH_W, ADDHH_W, "addhh.w"),
    NORMAL_MNEMONIC(AND, AND1, "and"),
    NORMAL_MNEMONIC(ANDH, ANDH, "andh"),
    NORMAL_MNEMONIC(ANDL, ANDL, "andl"),
    NORMAL_MNEMONIC(ANDN, ANDN, "andn"),
    NORMAL_MNEMONIC(ASR, ASR1, "asr"),
    NORMAL_MNEMONIC(BFEXTS, BFEXTS, "bfexts"),
    NORMAL_MNEMONIC(BFEXTU, BFEXTU, "bfextu"),
    NORMAL_MNEMONIC(BFINS, BFINS, "bfins"),
    NORMAL_MNEMONIC(BLD, BLD, "bld"),
    NORMAL_MNEMONIC(BREQ, BREQ1, "breq"),
    NORMAL_MNEMONIC(BRNE, BRNE1, "brne"),
    NORMAL_MNEMONIC(BRCC, BRCC1, "brcc"),
    NORMAL_MNEMONIC(BRCS, BRCS1, "brcs"),
    NORMAL_MNEMONIC(BRGE, BRGE1, "brge"),
    NORMAL_MNEMONIC(BRLT, BRLT1, "brlt"),
    NORMAL_MNEMONIC(BRMI, BRMI1, "brmi"),
    NORMAL_MNEMONIC(BRPL, BRPL1, "brpl"),
    NORMAL_MNEMONIC(BRHS, BRHS1, "brhs"),
    NORMAL_MNEMONIC(BRLO, BRLO1, "brlo"),
    NORMAL_MNEMONIC(BRLS, BRLS, "brls"),
    NORMAL_MNEMONIC(BRGT, BRGT, "brgt"),
    NORMAL_MNEMONIC(BRLE, BRLE, "brle"),
    NORMAL_MNEMONIC(BRHI, BRHI, "brhi"),
    NORMAL_MNEMONIC(BRVS, BRVS, "brvs"),
    NORMAL_MNEMONIC(BRVC, BRVC, "brvc"),
    NORMAL_MNEMONIC(BRQS, BRQS, "brqs"),
    NORMAL_MNEMONIC(BRAL, BRAL, "bral"),
    NORMAL_MNEMONIC(BREAKPOINT, BREAKPOINT, "breakpoint"),
    NORMAL_MNEMONIC(BREV, BREV, "brev"),
    NORMAL_MNEMONIC(BST, BST, "bst"),
    NORMAL_MNEMONIC(CACHE, CACHE, "cache"),
    NORMAL_MNEMONIC(CASTS_B, CASTS_B, "casts.b"),
    NORMAL_MNEMONIC(CASTS_H, CASTS_H, "casts.h"),
    NORMAL_MNEMONIC(CASTU_B, CASTU_B, "castu.b"),
    NORMAL_MNEMONIC(CASTU_H, CASTU_H, "castu.h"),
    NORMAL_MNEMONIC(CBR, CBR, "cbr"),
    NORMAL_MNEMONIC(CLZ, CLZ, "clz"),
    NORMAL_MNEMONIC(COM, COM, "com"),
    NORMAL_MNEMONIC(COP, COP, "cop"),
    NORMAL_MNEMONIC(CP_B, CP_B, "cp.b"),
    NORMAL_MNEMONIC(CP_H, CP_H, "cp.h"),
    NORMAL_MNEMONIC(CP_W, CP_W1, "cp.w"),
    NORMAL_MNEMONIC(CP, CP_W1, "cp"),
    NORMAL_MNEMONIC(CPC, CPC1, "cpc"),
    NORMAL_MNEMONIC(CSRF, CSRF, "csrf"),
    NORMAL_MNEMONIC(CSRFCZ, CSRFCZ, "csrfcz"),
    NORMAL_MNEMONIC(DIVS, DIVS, "divs"),
    NORMAL_MNEMONIC(DIVU, DIVU, "divu"),
    NORMAL_MNEMONIC(EOR, EOR1, "eor"),
    NORMAL_MNEMONIC(EORL, EORL, "eorl"),
    NORMAL_MNEMONIC(EORH, EORH, "eorh"),
    NORMAL_MNEMONIC(FRS, FRS, "frs"),
    NORMAL_MNEMONIC(SSCALL, SSCALL, "sscall"),
    NORMAL_MNEMONIC(RETSS, RETSS, "retss"),
    NORMAL_MNEMONIC(ICALL, ICALL, "icall"),
    NORMAL_MNEMONIC(INCJOSP, INCJOSP, "incjosp"),
    NORMAL_MNEMONIC(LD_D, LD_D1, "ld.d"),
    NORMAL_MNEMONIC(LD_SB, LD_SB2, "ld.sb"),
    NORMAL_MNEMONIC(LD_UB, LD_UB1, "ld.ub"),
    NORMAL_MNEMONIC(LD_SH, LD_SH1, "ld.sh"),
    NORMAL_MNEMONIC(LD_UH, LD_UH1, "ld.uh"),
    NORMAL_MNEMONIC(LD_W, LD_W1, "ld.w"),
    NORMAL_MNEMONIC(LDC_D, LDC_D3, "ldc.d"),
    NORMAL_MNEMONIC(LDC_W, LDC_W3, "ldc.w"),
    NORMAL_MNEMONIC(LDC0_D, LDC0_D, "ldc0.d"),
    NORMAL_MNEMONIC(LDC0_W, LDC0_W, "ldc0.w"),
    NORMAL_MNEMONIC(LDCM_D, LDCM_D, "ldcm.d"),
    NORMAL_MNEMONIC(LDCM_W, LDCM_W, "ldcm.w"),
    NORMAL_MNEMONIC(LDDPC, LDDPC, "lddpc"),
    NORMAL_MNEMONIC(LDDSP, LDDSP, "lddsp"),
    NORMAL_MNEMONIC(LDINS_B, LDINS_B, "ldins.b"),
    NORMAL_MNEMONIC(LDINS_H, LDINS_H, "ldins.h"),
    NORMAL_MNEMONIC(LDM, LDM, "ldm"),
    NORMAL_MNEMONIC(LDMTS, LDMTS, "ldmts"),
    NORMAL_MNEMONIC(LDSWP_SH, LDSWP_SH, "ldswp.sh"),
    NORMAL_MNEMONIC(LDSWP_UH, LDSWP_UH, "ldswp.uh"),
    NORMAL_MNEMONIC(LDSWP_W, LDSWP_W, "ldswp.w"),
    NORMAL_MNEMONIC(LSL, LSL1, "lsl"),
    NORMAL_MNEMONIC(LSR, LSR1, "lsr"),
    NORMAL_MNEMONIC(MAC, MAC, "mac"),
    NORMAL_MNEMONIC(MACHH_D, MACHH_D, "machh.d"),
    NORMAL_MNEMONIC(MACHH_W, MACHH_W, "machh.w"),
    NORMAL_MNEMONIC(MACS_D, MACS_D, "macs.d"),
    NORMAL_MNEMONIC(MACSATHH_W, MACSATHH_W, "macsathh.w"),
    NORMAL_MNEMONIC(MACU_D, MACUD, "macu.d"),
    NORMAL_MNEMONIC(MACWH_D, MACWH_D, "macwh.d"),
    NORMAL_MNEMONIC(MAX, MAX, "max"),
    NORMAL_MNEMONIC(MCALL, MCALL, "mcall"),
    NORMAL_MNEMONIC(MFDR, MFDR, "mfdr"),
    NORMAL_MNEMONIC(MFSR, MFSR, "mfsr"),
    NORMAL_MNEMONIC(MIN, MIN, "min"),
    NORMAL_MNEMONIC(MOV, MOV3, "mov"),
    NORMAL_MNEMONIC(MOVEQ, MOVEQ1, "moveq"),
    NORMAL_MNEMONIC(MOVNE, MOVNE1, "movne"),
    NORMAL_MNEMONIC(MOVCC, MOVCC1, "movcc"),
    NORMAL_MNEMONIC(MOVCS, MOVCS1, "movcs"),
    NORMAL_MNEMONIC(MOVGE, MOVGE1, "movge"),
    NORMAL_MNEMONIC(MOVLT, MOVLT1, "movlt"),
    NORMAL_MNEMONIC(MOVMI, MOVMI1, "movmi"),
    NORMAL_MNEMONIC(MOVPL, MOVPL1, "movpl"),
    NORMAL_MNEMONIC(MOVLS, MOVLS1, "movls"),
    NORMAL_MNEMONIC(MOVGT, MOVGT1, "movgt"),
    NORMAL_MNEMONIC(MOVLE, MOVLE1, "movle"),
    NORMAL_MNEMONIC(MOVHI, MOVHI1, "movhi"),
    NORMAL_MNEMONIC(MOVVS, MOVVS1, "movvs"),
    NORMAL_MNEMONIC(MOVVC, MOVVC1, "movvc"),
    NORMAL_MNEMONIC(MOVQS, MOVQS1, "movqs"),
    NORMAL_MNEMONIC(MOVAL, MOVAL1, "moval"),
    NORMAL_MNEMONIC(MOVHS, MOVHS1, "movhs"),
    NORMAL_MNEMONIC(MOVLO, MOVLO1, "movlo"),
    NORMAL_MNEMONIC(MTDR, MTDR, "mtdr"),
    NORMAL_MNEMONIC(MTSR, MTSR, "mtsr"),
    NORMAL_MNEMONIC(MUL, MUL1, "mul"),
    NORMAL_MNEMONIC(MULHH_W, MULHH_W, "mulhh.w"),
    NORMAL_MNEMONIC(MULNHH_W, MULNHH_W, "mulnhh.w"),
    NORMAL_MNEMONIC(MULNWH_D, MULNWH_D, "mulnwh.d"),
    NORMAL_MNEMONIC(MULS_D, MULSD, "muls.d"),
    NORMAL_MNEMONIC(MULSATHH_H, MULSATHH_H, "mulsathh.h"),
    NORMAL_MNEMONIC(MULSATHH_W, MULSATHH_W, "mulsathh.w"),
    NORMAL_MNEMONIC(MULSATRNDHH_H, MULSATRNDHH_H, "mulsatrndhh.h"),
    NORMAL_MNEMONIC(MULSATRNDWH_W, MULSATRNDWH_W, "mulsatrndwh.w"),
    NORMAL_MNEMONIC(MULSATWH_W, MULSATWH_W, "mulsatwh.w"),
    NORMAL_MNEMONIC(MULU_D, MULU_D, "mulu.d"),
    NORMAL_MNEMONIC(MULWH_D, MULWH_D, "mulwh.d"),
    NORMAL_MNEMONIC(MUSFR, MUSFR, "musfr"),
    NORMAL_MNEMONIC(MUSTR, MUSTR, "mustr"),
    NORMAL_MNEMONIC(MVCR_D, MVCR_D, "mvcr.d"),
    NORMAL_MNEMONIC(MVCR_W, MVCR_W, "mvcr.w"),
    NORMAL_MNEMONIC(MVRC_D, MVRC_D, "mvrc.d"),
    NORMAL_MNEMONIC(MVRC_W, MVRC_W, "mvrc.w"),
    NORMAL_MNEMONIC(NEG, NEG, "neg"),
    NORMAL_MNEMONIC(NOP, NOP, "nop"),
    NORMAL_MNEMONIC(OR, OR1, "or"),
    NORMAL_MNEMONIC(ORH, ORH, "orh"),
    NORMAL_MNEMONIC(ORL, ORL, "orl"),
    NORMAL_MNEMONIC(PABS_SB, PABS_SB, "pabs.sb"),
    NORMAL_MNEMONIC(PABS_SH, PABS_SH, "pabs.sh"),
    NORMAL_MNEMONIC(PACKSH_SB, PACKSH_SB, "packsh.sb"),
    NORMAL_MNEMONIC(PACKSH_UB, PACKSH_UB, "packsh.ub"),
    NORMAL_MNEMONIC(PACKW_SH, PACKW_SH, "packw.sh"),
    NORMAL_MNEMONIC(PADD_B, PADD_B, "padd.b"),
    NORMAL_MNEMONIC(PADD_H, PADD_H, "padd.h"),
    NORMAL_MNEMONIC(PADDH_SH, PADDH_SH, "paddh.sh"),
    NORMAL_MNEMONIC(PADDH_UB, PADDH_UB, "paddh.ub"),
    NORMAL_MNEMONIC(PADDS_SB, PADDS_SB, "padds.sb"),
    NORMAL_MNEMONIC(PADDS_SH, PADDS_SH, "padds.sh"),
    NORMAL_MNEMONIC(PADDS_UB, PADDS_UB, "padds.ub"),
    NORMAL_MNEMONIC(PADDS_UH, PADDS_UH, "padds.uh"),
    NORMAL_MNEMONIC(PADDSUB_H, PADDSUB_H, "paddsub.h"),
    NORMAL_MNEMONIC(PADDSUBH_SH, PADDSUBH_SH, "paddsubh.sh"),
    NORMAL_MNEMONIC(PADDSUBS_SH, PADDSUBS_SH, "paddsubs.sh"),
    NORMAL_MNEMONIC(PADDSUBS_UH, PADDSUBS_UH, "paddsubs.uh"),
    NORMAL_MNEMONIC(PADDX_H, PADDX_H, "paddx.h"),
    NORMAL_MNEMONIC(PADDXH_SH, PADDXH_SH, "paddxh.sh"),
    NORMAL_MNEMONIC(PADDXS_SH, PADDXS_SH, "paddxs.sh"),
    NORMAL_MNEMONIC(PADDXS_UH, PADDXS_UH, "paddxs.uh"),
    NORMAL_MNEMONIC(PASR_B, PASR_B, "pasr.b"),
    NORMAL_MNEMONIC(PASR_H, PASR_H, "pasr.h"),
    NORMAL_MNEMONIC(PAVG_SH, PAVG_SH, "pavg.sh"),
    NORMAL_MNEMONIC(PAVG_UB, PAVG_UB, "pavg.ub"),
    NORMAL_MNEMONIC(PLSL_B, PLSL_B, "plsl.b"),
    NORMAL_MNEMONIC(PLSL_H, PLSL_H, "plsl.h"),
    NORMAL_MNEMONIC(PLSR_B, PLSR_B, "plsr.b"),
    NORMAL_MNEMONIC(PLSR_H, PLSR_H, "plsr.h"),
    NORMAL_MNEMONIC(PMAX_SH, PMAX_SH, "pmax.sh"),
    NORMAL_MNEMONIC(PMAX_UB, PMAX_UB, "pmax.ub"),
    NORMAL_MNEMONIC(PMIN_SH, PMIN_SH, "pmin.sh"),
    NORMAL_MNEMONIC(PMIN_UB, PMIN_UB, "pmin.ub"),
    NORMAL_MNEMONIC(POPJC, POPJC, "popjc"),
    NORMAL_MNEMONIC(POPM, POPM, "popm"),
    NORMAL_MNEMONIC(PREF, PREF, "pref"),
    NORMAL_MNEMONIC(PSAD, PSAD, "psad"),
    NORMAL_MNEMONIC(PSUB_B, PSUB_B, "psub.b"),
    NORMAL_MNEMONIC(PSUB_H, PSUB_H, "psub.h"),
    NORMAL_MNEMONIC(PSUBADD_H, PSUBADD_H, "psubadd.h"),
    NORMAL_MNEMONIC(PSUBADDH_SH, PSUBADDH_SH, "psubaddh.sh"),
    NORMAL_MNEMONIC(PSUBADDS_SH, PSUBADDS_SH, "psubadds.sh"),
    NORMAL_MNEMONIC(PSUBADDS_UH, PSUBADDS_UH, "psubadds.uh"),
    NORMAL_MNEMONIC(PSUBH_SH, PSUBH_SH, "psubh.sh"),
    NORMAL_MNEMONIC(PSUBH_UB, PSUBH_UB, "psubh.ub"),
    NORMAL_MNEMONIC(PSUBS_SB, PSUBS_SB, "psubs.sb"),
    NORMAL_MNEMONIC(PSUBS_SH, PSUBS_SH, "psubs.sh"),
    NORMAL_MNEMONIC(PSUBS_UB, PSUBS_UB, "psubs.ub"),
    NORMAL_MNEMONIC(PSUBS_UH, PSUBS_UH, "psubs.uh"),
    NORMAL_MNEMONIC(PSUBX_H, PSUBX_H, "psubx.h"),
    NORMAL_MNEMONIC(PSUBXH_SH, PSUBXH_SH, "psubxh.sh"),
    NORMAL_MNEMONIC(PSUBXS_SH, PSUBXS_SH, "psubxs.sh"),
    NORMAL_MNEMONIC(PSUBXS_UH, PSUBXS_UH, "psubxs.uh"),
    NORMAL_MNEMONIC(PUNPCKSB_H, PUNPCKSB_H, "punpcksb.h"),
    NORMAL_MNEMONIC(PUNPCKUB_H, PUNPCKUB_H, "punpckub.h"),
    NORMAL_MNEMONIC(PUSHJC, PUSHJC, "pushjc"),
    NORMAL_MNEMONIC(PUSHM, PUSHM, "pushm"),
    NORMAL_MNEMONIC(RCALL, RCALL1, "rcall"),
    NORMAL_MNEMONIC(RETEQ, RETEQ, "reteq"),
    NORMAL_MNEMONIC(RETNE, RETNE, "retne"),
    NORMAL_MNEMONIC(RETCC, RETCC, "retcc"),
    NORMAL_MNEMONIC(RETCS, RETCS, "retcs"),
    NORMAL_MNEMONIC(RETGE, RETGE, "retge"),
    NORMAL_MNEMONIC(RETLT, RETLT, "retlt"),
    NORMAL_MNEMONIC(RETMI, RETMI, "retmi"),
    NORMAL_MNEMONIC(RETPL, RETPL, "retpl"),
    NORMAL_MNEMONIC(RETLS, RETLS, "retls"),
    NORMAL_MNEMONIC(RETGT, RETGT, "retgt"),
    NORMAL_MNEMONIC(RETLE, RETLE, "retle"),
    NORMAL_MNEMONIC(RETHI, RETHI, "rethi"),
    NORMAL_MNEMONIC(RETVS, RETVS, "retvs"),
    NORMAL_MNEMONIC(RETVC, RETVC, "retvc"),
    NORMAL_MNEMONIC(RETQS, RETQS, "retqs"),
    NORMAL_MNEMONIC(RETAL, RETAL, "retal"),
    NORMAL_MNEMONIC(RETHS, RETHS, "reths"),
    NORMAL_MNEMONIC(RETLO, RETLO, "retlo"),
    NORMAL_MNEMONIC(RET, RETAL, "ret"),
    NORMAL_MNEMONIC(RETD, RETD, "retd"),
    NORMAL_MNEMONIC(RETE, RETE, "rete"),
    NORMAL_MNEMONIC(RETJ, RETJ, "retj"),
    NORMAL_MNEMONIC(RETS, RETS, "rets"),
    NORMAL_MNEMONIC(RJMP, RJMP, "rjmp"),
    NORMAL_MNEMONIC(ROL, ROL, "rol"),
    NORMAL_MNEMONIC(ROR, ROR, "ror"),
    NORMAL_MNEMONIC(RSUB, RSUB1, "rsub"),
    NORMAL_MNEMONIC(SATADD_H, SATADD_H, "satadd.h"),
    NORMAL_MNEMONIC(SATADD_W, SATADD_W, "satadd.w"),
    NORMAL_MNEMONIC(SATRNDS, SATRNDS, "satrnds"),
    NORMAL_MNEMONIC(SATRNDU, SATRNDU, "satrndu"),
    NORMAL_MNEMONIC(SATS, SATS, "sats"),
    NORMAL_MNEMONIC(SATSUB_H, SATSUB_H, "satsub.h"),
    NORMAL_MNEMONIC(SATSUB_W, SATSUB_W1, "satsub.w"),
    NORMAL_MNEMONIC(SATU, SATU, "satu"),
    NORMAL_MNEMONIC(SBC, SBC, "sbc"),
    NORMAL_MNEMONIC(SBR, SBR, "sbr"),
    NORMAL_MNEMONIC(SCALL, SCALL, "scall"),
    NORMAL_MNEMONIC(SCR, SCR, "scr"),
    NORMAL_MNEMONIC(SLEEP, SLEEP, "sleep"),
    NORMAL_MNEMONIC(SREQ, SREQ, "sreq"),
    NORMAL_MNEMONIC(SRNE, SRNE, "srne"),
    NORMAL_MNEMONIC(SRCC, SRCC, "srcc"),
    NORMAL_MNEMONIC(SRCS, SRCS, "srcs"),
    NORMAL_MNEMONIC(SRGE, SRGE, "srge"),
    NORMAL_MNEMONIC(SRLT, SRLT, "srlt"),
    NORMAL_MNEMONIC(SRMI, SRMI, "srmi"),
    NORMAL_MNEMONIC(SRPL, SRPL, "srpl"),
    NORMAL_MNEMONIC(SRLS, SRLS, "srls"),
    NORMAL_MNEMONIC(SRGT, SRGT, "srgt"),
    NORMAL_MNEMONIC(SRLE, SRLE, "srle"),
    NORMAL_MNEMONIC(SRHI, SRHI, "srhi"),
    NORMAL_MNEMONIC(SRVS, SRVS, "srvs"),
    NORMAL_MNEMONIC(SRVC, SRVC, "srvc"),
    NORMAL_MNEMONIC(SRQS, SRQS, "srqs"),
    NORMAL_MNEMONIC(SRAL, SRAL, "sral"),
    NORMAL_MNEMONIC(SRHS, SRHS, "srhs"),
    NORMAL_MNEMONIC(SRLO, SRLO, "srlo"),
    NORMAL_MNEMONIC(SSRF, SSRF, "ssrf"),
    NORMAL_MNEMONIC(ST_B, ST_B1, "st.b"),
    NORMAL_MNEMONIC(ST_D, ST_D1, "st.d"),
    NORMAL_MNEMONIC(ST_H, ST_H1, "st.h"),
    NORMAL_MNEMONIC(ST_W, ST_W1, "st.w"),
    NORMAL_MNEMONIC(STC_D, STC_D3, "stc.d"),
    NORMAL_MNEMONIC(STC_W, STC_W3, "stc.w"),
    NORMAL_MNEMONIC(STC0_D, STC0_D, "stc0.d"),
    NORMAL_MNEMONIC(STC0_W, STC0_W, "stc0.w"),
    NORMAL_MNEMONIC(STCM_D, STCM_D, "stcm.d"),
    NORMAL_MNEMONIC(STCM_W, STCM_W, "stcm.w"),
    NORMAL_MNEMONIC(STCOND, STCOND, "stcond"),
    NORMAL_MNEMONIC(STDSP, STDSP, "stdsp"),
    NORMAL_MNEMONIC(STHH_W, STHH_W2, "sthh.w"),
    NORMAL_MNEMONIC(STM, STM, "stm"),
    NORMAL_MNEMONIC(STMTS, STMTS, "stmts"),
    NORMAL_MNEMONIC(STSWP_H, STSWP_H, "stswp.h"),
    NORMAL_MNEMONIC(STSWP_W, STSWP_W, "stswp.w"),
    NORMAL_MNEMONIC(SUB, SUB1, "sub"),
    NORMAL_MNEMONIC(SUBEQ, SUBEQ, "subeq"),
    NORMAL_MNEMONIC(SUBNE, SUBNE, "subne"),
    NORMAL_MNEMONIC(SUBCC, SUBCC, "subcc"),
    NORMAL_MNEMONIC(SUBCS, SUBCS, "subcs"),
    NORMAL_MNEMONIC(SUBGE, SUBGE, "subge"),
    NORMAL_MNEMONIC(SUBLT, SUBLT, "sublt"),
    NORMAL_MNEMONIC(SUBMI, SUBMI, "submi"),
    NORMAL_MNEMONIC(SUBPL, SUBPL, "subpl"),
    NORMAL_MNEMONIC(SUBLS, SUBLS, "subls"),
    NORMAL_MNEMONIC(SUBGT, SUBGT, "subgt"),
    NORMAL_MNEMONIC(SUBLE, SUBLE, "suble"),
    NORMAL_MNEMONIC(SUBHI, SUBHI, "subhi"),
    NORMAL_MNEMONIC(SUBVS, SUBVS, "subvs"),
    NORMAL_MNEMONIC(SUBVC, SUBVC, "subvc"),
    NORMAL_MNEMONIC(SUBQS, SUBQS, "subqs"),
    NORMAL_MNEMONIC(SUBAL, SUBAL, "subal"),
    NORMAL_MNEMONIC(SUBHS, SUBHS, "subhs"),
    NORMAL_MNEMONIC(SUBLO, SUBLO, "sublo"),
    NORMAL_MNEMONIC(SUBFEQ, SUBFEQ, "subfeq"),
    NORMAL_MNEMONIC(SUBFNE, SUBFNE, "subfne"),
    NORMAL_MNEMONIC(SUBFCC, SUBFCC, "subfcc"),
    NORMAL_MNEMONIC(SUBFCS, SUBFCS, "subfcs"),
    NORMAL_MNEMONIC(SUBFGE, SUBFGE, "subfge"),
    NORMAL_MNEMONIC(SUBFLT, SUBFLT, "subflt"),
    NORMAL_MNEMONIC(SUBFMI, SUBFMI, "subfmi"),
    NORMAL_MNEMONIC(SUBFPL, SUBFPL, "subfpl"),
    NORMAL_MNEMONIC(SUBFLS, SUBFLS, "subfls"),
    NORMAL_MNEMONIC(SUBFGT, SUBFGT, "subfgt"),
    NORMAL_MNEMONIC(SUBFLE, SUBFLE, "subfle"),
    NORMAL_MNEMONIC(SUBFHI, SUBFHI, "subfhi"),
    NORMAL_MNEMONIC(SUBFVS, SUBFVS, "subfvs"),
    NORMAL_MNEMONIC(SUBFVC, SUBFVC, "subfvc"),
    NORMAL_MNEMONIC(SUBFQS, SUBFQS, "subfqs"),
    NORMAL_MNEMONIC(SUBFAL, SUBFAL, "subfal"),
    NORMAL_MNEMONIC(SUBFHS, SUBFHS, "subfhs"),
    NORMAL_MNEMONIC(SUBFLO, SUBFLO, "subflo"),
    NORMAL_MNEMONIC(SUBHH_W, SUBHH_W, "subhh.w"),
    NORMAL_MNEMONIC(SWAP_B, SWAP_B, "swap.b"),
    NORMAL_MNEMONIC(SWAP_BH, SWAP_BH, "swap.bh"),
    NORMAL_MNEMONIC(SWAP_H, SWAP_H, "swap.h"),
    NORMAL_MNEMONIC(SYNC, SYNC, "sync"),
    NORMAL_MNEMONIC(TLBR, TLBR, "tlbr"),
    NORMAL_MNEMONIC(TLBS, TLBS, "tlbs"),
    NORMAL_MNEMONIC(TLBW, TLBW, "tlbw"),
    NORMAL_MNEMONIC(TNBZ, TNBZ, "tnbz"),
    NORMAL_MNEMONIC(TST, TST, "tst"),
    NORMAL_MNEMONIC(XCHG, XCHG, "xchg"),
    NORMAL_MNEMONIC(MEMC, MEMC, "memc"),
    NORMAL_MNEMONIC(MEMS, MEMS, "mems"),
    NORMAL_MNEMONIC(MEMT, MEMT, "memt"),
  NORMAL_MNEMONIC (FMAC_S,     FMAC_S,     "fmac.s"),
  NORMAL_MNEMONIC (FNMAC_S,    FNMAC_S,    "fnmac.s"),
  NORMAL_MNEMONIC (FMSC_S,     FMSC_S,     "fmsc.s"), 
  NORMAL_MNEMONIC (FNMSC_S,    FNMSC_S,    "fnmsc.s"), 
  NORMAL_MNEMONIC (FMUL_S,     FMUL_S,     "fmul.s"),
  NORMAL_MNEMONIC (FNMUL_S,    FNMUL_S,    "fnmul.s"),
  NORMAL_MNEMONIC (FADD_S,     FADD_S,     "fadd.s"),
  NORMAL_MNEMONIC (FSUB_S,     FSUB_S,     "fsub.s"),
  NORMAL_MNEMONIC (FCASTRS_SW, FCASTRS_SW, "fcastrs.sw"),
  NORMAL_MNEMONIC (FCASTRS_UW, FCASTRS_UW, "fcastrs.uw"),
  NORMAL_MNEMONIC (FCASTSW_S,  FCASTSW_S,  "fcastsw.s"),
  NORMAL_MNEMONIC (FCASTUW_S,  FCASTUW_S,  "fcastuw.s"),
  NORMAL_MNEMONIC (FCMP_S,     FCMP_S,     "fcmp.s"),
  NORMAL_MNEMONIC (FCHK_S,     FCHK_S,     "fchk.s"),
  NORMAL_MNEMONIC (FRCPA_S,    FRCPA_S,    "frcpa.s"),
  NORMAL_MNEMONIC (FRSQRTA_S,  FRSQRTA_S,  "frsqrta.s"),
    NORMAL_MNEMONIC(LDA_W, LDA_W, "lda.w"),
    NORMAL_MNEMONIC(CALL, CALL, "call"),
    NORMAL_MNEMONIC(PICOSVMAC, PICOSVMAC0, "picosvmac"),
    NORMAL_MNEMONIC(PICOSVMUL, PICOSVMUL0, "picosvmul"),
    NORMAL_MNEMONIC(PICOVMAC, PICOVMAC0, "picovmac"),
    NORMAL_MNEMONIC(PICOVMUL, PICOVMUL0, "picovmul"),
    NORMAL_MNEMONIC(PICOLD_D, PICOLD_D2, "picold.d"),
    NORMAL_MNEMONIC(PICOLD_W, PICOLD_W2, "picold.w"),
    NORMAL_MNEMONIC(PICOLDM_D, PICOLDM_D, "picoldm.d"),
    NORMAL_MNEMONIC(PICOLDM_W, PICOLDM_W, "picoldm.w"),
    NORMAL_MNEMONIC(PICOMV_D, PICOMV_D1, "picomv.d"),
    NORMAL_MNEMONIC(PICOMV_W, PICOMV_W1, "picomv.w"),
    NORMAL_MNEMONIC(PICOST_D, PICOST_D2, "picost.d"),
    NORMAL_MNEMONIC(PICOST_W, PICOST_W2, "picost.w"),
    NORMAL_MNEMONIC(PICOSTM_D, PICOSTM_D, "picostm.d"),
    NORMAL_MNEMONIC(PICOSTM_W, PICOSTM_W, "picostm.w"),
    NORMAL_MNEMONIC(RSUBEQ, RSUBEQ, "rsubeq"),
    NORMAL_MNEMONIC(RSUBNE, RSUBNE, "rsubne"),
    NORMAL_MNEMONIC(RSUBCC, RSUBCC, "rsubcc"),
    NORMAL_MNEMONIC(RSUBCS, RSUBCS, "rsubcs"),
    NORMAL_MNEMONIC(RSUBGE, RSUBGE, "rsubge"),
    NORMAL_MNEMONIC(RSUBLT, RSUBLT, "rsublt"),
    NORMAL_MNEMONIC(RSUBMI, RSUBMI, "rsubmi"),
    NORMAL_MNEMONIC(RSUBPL, RSUBPL, "rsubpl"),
    NORMAL_MNEMONIC(RSUBLS, RSUBLS, "rsubls"),
    NORMAL_MNEMONIC(RSUBGT, RSUBGT, "rsubgt"),
    NORMAL_MNEMONIC(RSUBLE, RSUBLE, "rsuble"),
    NORMAL_MNEMONIC(RSUBHI, RSUBHI, "rsubhi"),
    NORMAL_MNEMONIC(RSUBVS, RSUBVS, "rsubvs"),
    NORMAL_MNEMONIC(RSUBVC, RSUBVC, "rsubvc"),
    NORMAL_MNEMONIC(RSUBQS, RSUBQS, "rsubqs"),
    NORMAL_MNEMONIC(RSUBAL, RSUBAL, "rsubal"),
    NORMAL_MNEMONIC(RSUBHS, RSUBHS, "rsubhs"),
    NORMAL_MNEMONIC(RSUBLO, RSUBLO, "rsublo"),
    NORMAL_MNEMONIC(ADDEQ, ADDEQ, "addeq"),
    NORMAL_MNEMONIC(ADDNE, ADDNE, "addne"),
    NORMAL_MNEMONIC(ADDCC, ADDCC, "addcc"),
    NORMAL_MNEMONIC(ADDCS, ADDCS, "addcs"),
    NORMAL_MNEMONIC(ADDGE, ADDGE, "addge"),
    NORMAL_MNEMONIC(ADDLT, ADDLT, "addlt"),
    NORMAL_MNEMONIC(ADDMI, ADDMI, "addmi"),
    NORMAL_MNEMONIC(ADDPL, ADDPL, "addpl"),
    NORMAL_MNEMONIC(ADDLS, ADDLS, "addls"),
    NORMAL_MNEMONIC(ADDGT, ADDGT, "addgt"),
    NORMAL_MNEMONIC(ADDLE, ADDLE, "addle"),
    NORMAL_MNEMONIC(ADDHI, ADDHI, "addhi"),
    NORMAL_MNEMONIC(ADDVS, ADDVS, "addvs"),
    NORMAL_MNEMONIC(ADDVC, ADDVC, "addvc"),
    NORMAL_MNEMONIC(ADDQS, ADDQS, "addqs"),
    NORMAL_MNEMONIC(ADDAL, ADDAL, "addal"),
    NORMAL_MNEMONIC(ADDHS, ADDHS, "addhs"),
    NORMAL_MNEMONIC(ADDLO, ADDLO, "addlo"),
    NORMAL_MNEMONIC(ANDEQ, ANDEQ, "andeq"),
    NORMAL_MNEMONIC(ANDNE, ANDNE, "andne"),
    NORMAL_MNEMONIC(ANDCC, ANDCC, "andcc"),
    NORMAL_MNEMONIC(ANDCS, ANDCS, "andcs"),
    NORMAL_MNEMONIC(ANDGE, ANDGE, "andge"),
    NORMAL_MNEMONIC(ANDLT, ANDLT, "andlt"),
    NORMAL_MNEMONIC(ANDMI, ANDMI, "andmi"),
    NORMAL_MNEMONIC(ANDPL, ANDPL, "andpl"),
    NORMAL_MNEMONIC(ANDLS, ANDLS, "andls"),
    NORMAL_MNEMONIC(ANDGT, ANDGT, "andgt"),
    NORMAL_MNEMONIC(ANDLE, ANDLE, "andle"),
    NORMAL_MNEMONIC(ANDHI, ANDHI, "andhi"),
    NORMAL_MNEMONIC(ANDVS, ANDVS, "andvs"),
    NORMAL_MNEMONIC(ANDVC, ANDVC, "andvc"),
    NORMAL_MNEMONIC(ANDQS, ANDQS, "andqs"),
    NORMAL_MNEMONIC(ANDAL, ANDAL, "andal"),
    NORMAL_MNEMONIC(ANDHS, ANDHS, "andhs"),
    NORMAL_MNEMONIC(ANDLO, ANDLO, "andlo"),
    NORMAL_MNEMONIC(OREQ, OREQ, "oreq"),
    NORMAL_MNEMONIC(ORNE, ORNE, "orne"),
    NORMAL_MNEMONIC(ORCC, ORCC, "orcc"),
    NORMAL_MNEMONIC(ORCS, ORCS, "orcs"),
    NORMAL_MNEMONIC(ORGE, ORGE, "orge"),
    NORMAL_MNEMONIC(ORLT, ORLT, "orlt"),
    NORMAL_MNEMONIC(ORMI, ORMI, "ormi"),
    NORMAL_MNEMONIC(ORPL, ORPL, "orpl"),
    NORMAL_MNEMONIC(ORLS, ORLS, "orls"),
    NORMAL_MNEMONIC(ORGT, ORGT, "orgt"),
    NORMAL_MNEMONIC(ORLE, ORLE, "orle"),
    NORMAL_MNEMONIC(ORHI, ORHI, "orhi"),
    NORMAL_MNEMONIC(ORVS, ORVS, "orvs"),
    NORMAL_MNEMONIC(ORVC, ORVC, "orvc"),
    NORMAL_MNEMONIC(ORQS, ORQS, "orqs"),
    NORMAL_MNEMONIC(ORAL, ORAL, "oral"),
    NORMAL_MNEMONIC(ORHS, ORHS, "orhs"),
    NORMAL_MNEMONIC(ORLO, ORLO, "orlo"),
    NORMAL_MNEMONIC(EOREQ, EOREQ, "eoreq"),
    NORMAL_MNEMONIC(EORNE, EORNE, "eorne"),
    NORMAL_MNEMONIC(EORCC, EORCC, "eorcc"),
    NORMAL_MNEMONIC(EORCS, EORCS, "eorcs"),
    NORMAL_MNEMONIC(EORGE, EORGE, "eorge"),
    NORMAL_MNEMONIC(EORLT, EORLT, "eorlt"),
    NORMAL_MNEMONIC(EORMI, EORMI, "eormi"),
    NORMAL_MNEMONIC(EORPL, EORPL, "eorpl"),
    NORMAL_MNEMONIC(EORLS, EORLS, "eorls"),
    NORMAL_MNEMONIC(EORGT, EORGT, "eorgt"),
    NORMAL_MNEMONIC(EORLE, EORLE, "eorle"),
    NORMAL_MNEMONIC(EORHI, EORHI, "eorhi"),
    NORMAL_MNEMONIC(EORVS, EORVS, "eorvs"),
    NORMAL_MNEMONIC(EORVC, EORVC, "eorvc"),
    NORMAL_MNEMONIC(EORQS, EORQS, "eorqs"),
    NORMAL_MNEMONIC(EORAL, EORAL, "eoral"),
    NORMAL_MNEMONIC(EORHS, EORHS, "eorhs"),
    NORMAL_MNEMONIC(EORLO, EORLO, "eorlo"),
    NORMAL_MNEMONIC(LD_WEQ, LD_WEQ, "ld.weq"),
    NORMAL_MNEMONIC(LD_WNE, LD_WNE, "ld.wne"),
    NORMAL_MNEMONIC(LD_WCC, LD_WCC, "ld.wcc"),
    NORMAL_MNEMONIC(LD_WCS, LD_WCS, "ld.wcs"),
    NORMAL_MNEMONIC(LD_WGE, LD_WGE, "ld.wge"),
    NORMAL_MNEMONIC(LD_WLT, LD_WLT, "ld.wlt"),
    NORMAL_MNEMONIC(LD_WMI, LD_WMI, "ld.wmi"),
    NORMAL_MNEMONIC(LD_WPL, LD_WPL, "ld.wpl"),
    NORMAL_MNEMONIC(LD_WLS, LD_WLS, "ld.wls"),
    NORMAL_MNEMONIC(LD_WGT, LD_WGT, "ld.wgt"),
    NORMAL_MNEMONIC(LD_WLE, LD_WLE, "ld.wle"),
    NORMAL_MNEMONIC(LD_WHI, LD_WHI, "ld.whi"),
    NORMAL_MNEMONIC(LD_WVS, LD_WVS, "ld.wvs"),
    NORMAL_MNEMONIC(LD_WVC, LD_WVC, "ld.wvc"),
    NORMAL_MNEMONIC(LD_WQS, LD_WQS, "ld.wqs"),
    NORMAL_MNEMONIC(LD_WAL, LD_WAL, "ld.wal"),
    NORMAL_MNEMONIC(LD_WHS, LD_WHS, "ld.whs"),
    NORMAL_MNEMONIC(LD_WLO, LD_WLO, "ld.wlo"),
    NORMAL_MNEMONIC(LD_SHEQ, LD_SHEQ, "ld.sheq"),
    NORMAL_MNEMONIC(LD_SHNE, LD_SHNE, "ld.shne"),
    NORMAL_MNEMONIC(LD_SHCC, LD_SHCC, "ld.shcc"),
    NORMAL_MNEMONIC(LD_SHCS, LD_SHCS, "ld.shcs"),
    NORMAL_MNEMONIC(LD_SHGE, LD_SHGE, "ld.shge"),
    NORMAL_MNEMONIC(LD_SHLT, LD_SHLT, "ld.shlt"),
    NORMAL_MNEMONIC(LD_SHMI, LD_SHMI, "ld.shmi"),
    NORMAL_MNEMONIC(LD_SHPL, LD_SHPL, "ld.shpl"),
    NORMAL_MNEMONIC(LD_SHLS, LD_SHLS, "ld.shls"),
    NORMAL_MNEMONIC(LD_SHGT, LD_SHGT, "ld.shgt"),
    NORMAL_MNEMONIC(LD_SHLE, LD_SHLE, "ld.shle"),
    NORMAL_MNEMONIC(LD_SHHI, LD_SHHI, "ld.shhi"),
    NORMAL_MNEMONIC(LD_SHVS, LD_SHVS, "ld.shvs"),
    NORMAL_MNEMONIC(LD_SHVC, LD_SHVC, "ld.shvc"),
    NORMAL_MNEMONIC(LD_SHQS, LD_SHQS, "ld.shqs"),
    NORMAL_MNEMONIC(LD_SHAL, LD_SHAL, "ld.shal"),
    NORMAL_MNEMONIC(LD_SHHS, LD_SHHS, "ld.shhs"),
    NORMAL_MNEMONIC(LD_SHLO, LD_SHLO, "ld.shlo"),
    NORMAL_MNEMONIC(LD_UHEQ, LD_UHEQ, "ld.uheq"),
    NORMAL_MNEMONIC(LD_UHNE, LD_UHNE, "ld.uhne"),
    NORMAL_MNEMONIC(LD_UHCC, LD_UHCC, "ld.uhcc"),
    NORMAL_MNEMONIC(LD_UHCS, LD_UHCS, "ld.uhcs"),
    NORMAL_MNEMONIC(LD_UHGE, LD_UHGE, "ld.uhge"),
    NORMAL_MNEMONIC(LD_UHLT, LD_UHLT, "ld.uhlt"),
