fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/opcodes/avr32-opc.c
    NORMAL_MNEMONIC(LD_UHMI, LD_UHMI, "ld.uhmi"),
    NORMAL_MNEMONIC(LD_UHPL, LD_UHPL, "ld.uhpl"),
    NORMAL_MNEMONIC(LD_UHLS, LD_UHLS, "ld.uhls"),
    NORMAL_MNEMONIC(LD_UHGT, LD_UHGT, "ld.uhgt"),
    NORMAL_MNEMONIC(LD_UHLE, LD_UHLE, "ld.uhle"),
    NORMAL_MNEMONIC(LD_UHHI, LD_UHHI, "ld.uhhi"),
    NORMAL_MNEMONIC(LD_UHVS, LD_UHVS, "ld.uhvs"),
    NORMAL_MNEMONIC(LD_UHVC, LD_UHVC, "ld.uhvc"),
    NORMAL_MNEMONIC(LD_UHQS, LD_UHQS, "ld.uhqs"),
    NORMAL_MNEMONIC(LD_UHAL, LD_UHAL, "ld.uhal"),
    NORMAL_MNEMONIC(LD_UHHS, LD_UHHS, "ld.uhhs"),
    NORMAL_MNEMONIC(LD_UHLO, LD_UHLO, "ld.uhlo"),
    NORMAL_MNEMONIC(LD_SBEQ, LD_SBEQ, "ld.sbeq"),
    NORMAL_MNEMONIC(LD_SBNE, LD_SBNE, "ld.sbne"),
    NORMAL_MNEMONIC(LD_SBCC, LD_SBCC, "ld.sbcc"),
    NORMAL_MNEMONIC(LD_SBCS, LD_SBCS, "ld.sbcs"),
    NORMAL_MNEMONIC(LD_SBGE, LD_SBGE, "ld.sbge"),
    NORMAL_MNEMONIC(LD_SBLT, LD_SBLT, "ld.sblt"),
    NORMAL_MNEMONIC(LD_SBMI, LD_SBMI, "ld.sbmi"),
    NORMAL_MNEMONIC(LD_SBPL, LD_SBPL, "ld.sbpl"),
    NORMAL_MNEMONIC(LD_SBLS, LD_SBLS, "ld.sbls"),
    NORMAL_MNEMONIC(LD_SBGT, LD_SBGT, "ld.sbgt"),
    NORMAL_MNEMONIC(LD_SBLE, LD_SBLE, "ld.sble"),
    NORMAL_MNEMONIC(LD_SBHI, LD_SBHI, "ld.sbhi"),
    NORMAL_MNEMONIC(LD_SBVS, LD_SBVS, "ld.sbvs"),
    NORMAL_MNEMONIC(LD_SBVC, LD_SBVC, "ld.sbvc"),
    NORMAL_MNEMONIC(LD_SBQS, LD_SBQS, "ld.sbqs"),
    NORMAL_MNEMONIC(LD_SBAL, LD_SBAL, "ld.sbal"),
    NORMAL_MNEMONIC(LD_SBHS, LD_SBHS, "ld.sbhs"),
    NORMAL_MNEMONIC(LD_SBLO, LD_SBLO, "ld.sblo"),
    NORMAL_MNEMONIC(LD_UBEQ, LD_UBEQ, "ld.ubeq"),
    NORMAL_MNEMONIC(LD_UBNE, LD_UBNE, "ld.ubne"),
    NORMAL_MNEMONIC(LD_UBCC, LD_UBCC, "ld.ubcc"),
    NORMAL_MNEMONIC(LD_UBCS, LD_UBCS, "ld.ubcs"),
    NORMAL_MNEMONIC(LD_UBGE, LD_UBGE, "ld.ubge"),
    NORMAL_MNEMONIC(LD_UBLT, LD_UBLT, "ld.ublt"),
    NORMAL_MNEMONIC(LD_UBMI, LD_UBMI, "ld.ubmi"),
    NORMAL_MNEMONIC(LD_UBPL, LD_UBPL, "ld.ubpl"),
    NORMAL_MNEMONIC(LD_UBLS, LD_UBLS, "ld.ubls"),
    NORMAL_MNEMONIC(LD_UBGT, LD_UBGT, "ld.ubgt"),
    NORMAL_MNEMONIC(LD_UBLE, LD_UBLE, "ld.uble"),
    NORMAL_MNEMONIC(LD_UBHI, LD_UBHI, "ld.ubhi"),
    NORMAL_MNEMONIC(LD_UBVS, LD_UBVS, "ld.ubvs"),
    NORMAL_MNEMONIC(LD_UBVC, LD_UBVC, "ld.ubvc"),
    NORMAL_MNEMONIC(LD_UBQS, LD_UBQS, "ld.ubqs"),
    NORMAL_MNEMONIC(LD_UBAL, LD_UBAL, "ld.ubal"),
    NORMAL_MNEMONIC(LD_UBHS, LD_UBHS, "ld.ubhs"),
    NORMAL_MNEMONIC(LD_UBLO, LD_UBLO, "ld.ublo"),
    NORMAL_MNEMONIC(ST_WEQ, ST_WEQ, "st.weq"),
    NORMAL_MNEMONIC(ST_WNE, ST_WNE, "st.wne"),
    NORMAL_MNEMONIC(ST_WCC, ST_WCC, "st.wcc"),
    NORMAL_MNEMONIC(ST_WCS, ST_WCS, "st.wcs"),
    NORMAL_MNEMONIC(ST_WGE, ST_WGE, "st.wge"),
    NORMAL_MNEMONIC(ST_WLT, ST_WLT, "st.wlt"),
    NORMAL_MNEMONIC(ST_WMI, ST_WMI, "st.wmi"),
    NORMAL_MNEMONIC(ST_WPL, ST_WPL, "st.wpl"),
    NORMAL_MNEMONIC(ST_WLS, ST_WLS, "st.wls"),
    NORMAL_MNEMONIC(ST_WGT, ST_WGT, "st.wgt"),
    NORMAL_MNEMONIC(ST_WLE, ST_WLE, "st.wle"),
    NORMAL_MNEMONIC(ST_WHI, ST_WHI, "st.whi"),
    NORMAL_MNEMONIC(ST_WVS, ST_WVS, "st.wvs"),
    NORMAL_MNEMONIC(ST_WVC, ST_WVC, "st.wvc"),
    NORMAL_MNEMONIC(ST_WQS, ST_WQS, "st.wqs"),
    NORMAL_MNEMONIC(ST_WAL, ST_WAL, "st.wal"),
    NORMAL_MNEMONIC(ST_WHS, ST_WHS, "st.whs"),
    NORMAL_MNEMONIC(ST_WLO, ST_WLO, "st.wlo"),
    NORMAL_MNEMONIC(ST_HEQ, ST_HEQ, "st.heq"),
    NORMAL_MNEMONIC(ST_HNE, ST_HNE, "st.hne"),
    NORMAL_MNEMONIC(ST_HCC, ST_HCC, "st.hcc"),
    NORMAL_MNEMONIC(ST_HCS, ST_HCS, "st.hcs"),
    NORMAL_MNEMONIC(ST_HGE, ST_HGE, "st.hge"),
    NORMAL_MNEMONIC(ST_HLT, ST_HLT, "st.hlt"),
    NORMAL_MNEMONIC(ST_HMI, ST_HMI, "st.hmi"),
    NORMAL_MNEMONIC(ST_HPL, ST_HPL, "st.hpl"),
    NORMAL_MNEMONIC(ST_HLS, ST_HLS, "st.hls"),
    NORMAL_MNEMONIC(ST_HGT, ST_HGT, "st.hgt"),
    NORMAL_MNEMONIC(ST_HLE, ST_HLE, "st.hle"),
    NORMAL_MNEMONIC(ST_HHI, ST_HHI, "st.hhi"),
    NORMAL_MNEMONIC(ST_HVS, ST_HVS, "st.hvs"),
    NORMAL_MNEMONIC(ST_HVC, ST_HVC, "st.hvc"),
    NORMAL_MNEMONIC(ST_HQS, ST_HQS, "st.hqs"),
    NORMAL_MNEMONIC(ST_HAL, ST_HAL, "st.hal"),
    NORMAL_MNEMONIC(ST_HHS, ST_HHS, "st.hhs"),
    NORMAL_MNEMONIC(ST_HLO, ST_HLO, "st.hlo"),
    NORMAL_MNEMONIC(ST_BEQ, ST_BEQ, "st.beq"),
    NORMAL_MNEMONIC(ST_BNE, ST_BNE, "st.bne"),
    NORMAL_MNEMONIC(ST_BCC, ST_BCC, "st.bcc"),
    NORMAL_MNEMONIC(ST_BCS, ST_BCS, "st.bcs"),
    NORMAL_MNEMONIC(ST_BGE, ST_BGE, "st.bge"),
    NORMAL_MNEMONIC(ST_BLT, ST_BLT, "st.blt"),
    NORMAL_MNEMONIC(ST_BMI, ST_BMI, "st.bmi"),
    NORMAL_MNEMONIC(ST_BPL, ST_BPL, "st.bpl"),
    NORMAL_MNEMONIC(ST_BLS, ST_BLS, "st.bls"),
    NORMAL_MNEMONIC(ST_BGT, ST_BGT, "st.bgt"),
    NORMAL_MNEMONIC(ST_BLE, ST_BLE, "st.ble"),
    NORMAL_MNEMONIC(ST_BHI, ST_BHI, "st.bhi"),
    NORMAL_MNEMONIC(ST_BVS, ST_BVS, "st.bvs"),
    NORMAL_MNEMONIC(ST_BVC, ST_BVC, "st.bvc"),
    NORMAL_MNEMONIC(ST_BQS, ST_BQS, "st.bqs"),
    NORMAL_MNEMONIC(ST_BAL, ST_BAL, "st.bal"),
    NORMAL_MNEMONIC(ST_BHS, ST_BHS, "st.bhs"),
    NORMAL_MNEMONIC(ST_BLO, ST_BLO, "st.blo"),
    NORMAL_MNEMONIC(MOVH, MOVH, "movh"),

  };
#undef NORMAL_MNEMONIC
#undef ALIAS_MNEMONIC
#undef FP_MNEMONIC
